; ModuleID = 'src/microhttpd/connection.c'
source_filename = "src/microhttpd/connection.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.MHD_Connection = type { %struct.MHD_Connection*, %struct.MHD_Connection*, %struct.MHD_Connection*, %struct.MHD_Connection*, %struct.MHD_Connection*, %struct.MHD_Connection*, %struct.MHD_Daemon*, %struct.MHD_HTTP_Header*, %struct.MHD_HTTP_Header*, %struct.MHD_Response*, %struct.MemoryPool*, i8*, i8*, i8*, i8*, i8*, i32, i8*, i8*, i8*, i8*, %struct.sockaddr*, %struct._MHD_thread_handle_ID_, i64, i64, i64, i64, i64, i64, i64, i64, %struct.MHD_iovec_track_, i32, i64, i32, i64, i64, i32, i8, i32, i32, i8, i8, i32, i32, i8, i8, i8, i8, i32, i32, i32, i32, i8, i64, i64, i64 (%struct.MHD_Connection*, i8*, i64)*, %struct.MHD_UpgradeResponseHandle*, i8, i32, i8 }

!123 = !DIEnumerator(name: "MHD_CONNECTION_HEADERS_SENDING", value: 10, isUnsigned: true)
!124 = !DIEnumerator(name: "MHD_CONNECTION_HEADERS_SENT", value: 11, isUnsigned: true)
!125 = !DIEnumerator(name: "MHD_CONNECTION_NORMAL_BODY_READY", value: 12, isUnsigned: true)
!126 = !DIEnumerator(name: "MHD_CONNECTION_NORMAL_BODY_UNREADY", value: 13, isUnsigned: true)
!127 = !DIEnumerator(name: "MHD_CONNECTION_CHUNKED_BODY_READY", value: 14, isUnsigned: true)
!128 = !DIEnumerator(name: "MHD_CONNECTION_CHUNKED_BODY_UNREADY", value: 15, isUnsigned: true)
!129 = !DIEnumerator(name: "MHD_CONNECTION_BODY_SENT", value: 16, isUnsigned: true)
!130 = !DIEnumerator(name: "MHD_CONNECTION_FOOTERS_SENDING", value: 17, isUnsigned: true)
!131 = !DIEnumerator(name: "MHD_CONNECTION_FOOTERS_SENT", value: 18, isUnsigned: true)
!132 = !DIEnumerator(name: "MHD_CONNECTION_CLOSED", value: 19, isUnsigned: true)
!133 = !DIEnumerator(name: "MHD_CONNECTION_UPGRADE", value: 20, isUnsigned: true)
!134 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MHD_ConnectionEventLoopInfo", file: !56, line: 232, baseType: !15, size: 32, elements: !135)
!135 = !{!136, !137, !138, !139}
!136 = !DIEnumerator(name: "MHD_EVENT_LOOP_INFO_READ", value: 0, isUnsigned: true)
!137 = !DIEnumerator(name: "MHD_EVENT_LOOP_INFO_WRITE", value: 1, isUnsigned: true)
!138 = !DIEnumerator(name: "MHD_EVENT_LOOP_INFO_BLOCK", value: 2, isUnsigned: true)
!139 = !DIEnumerator(name: "MHD_EVENT_LOOP_INFO_CLEANUP", value: 3, isUnsigned: true)
!140 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !141, line: 41, baseType: !15, size: 32, elements: !142)
!141 = !DIFile(filename: "/nix/store/9r0a3dipi8saq2zasp668zsk6qhqp5jb-glibc-2.32-48-dev/include/sys/socket.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!142 = !{!143, !144, !145}
!143 = !DIEnumerator(name: "SHUT_RD", value: 0, isUnsigned: true)
!144 = !DIEnumerator(name: "SHUT_WR", value: 1, isUnsigned: true)
!145 = !DIEnumerator(name: "SHUT_RDWR", value: 2, isUnsigned: true)
!146 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "EPOLL_EVENTS", file: !147, line: 34, baseType: !15, size: 32, elements: !148)
!147 = !DIFile(filename: "/nix/store/9r0a3dipi8saq2zasp668zsk6qhqp5jb-glibc-2.32-48-dev/include/sys/epoll.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!148 = !{!149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163}
!149 = !DIEnumerator(name: "EPOLLIN", value: 1, isUnsigned: true)
!150 = !DIEnumerator(name: "EPOLLPRI", value: 2, isUnsigned: true)
!151 = !DIEnumerator(name: "EPOLLOUT", value: 4, isUnsigned: true)
!152 = !DIEnumerator(name: "EPOLLRDNORM", value: 64, isUnsigned: true)
!153 = !DIEnumerator(name: "EPOLLRDBAND", value: 128, isUnsigned: true)
!154 = !DIEnumerator(name: "EPOLLWRNORM", value: 256, isUnsigned: true)
!155 = !DIEnumerator(name: "EPOLLWRBAND", value: 512, isUnsigned: true)
!156 = !DIEnumerator(name: "EPOLLMSG", value: 1024, isUnsigned: true)
!157 = !DIEnumerator(name: "EPOLLERR", value: 8, isUnsigned: true)
!158 = !DIEnumerator(name: "EPOLLHUP", value: 16, isUnsigned: true)
!159 = !DIEnumerator(name: "EPOLLRDHUP", value: 8192, isUnsigned: true)
!160 = !DIEnumerator(name: "EPOLLEXCLUSIVE", value: 268435456, isUnsigned: true)
!161 = !DIEnumerator(name: "EPOLLWAKEUP", value: 536870912, isUnsigned: true)
!162 = !DIEnumerator(name: "EPOLLONESHOT", value: 1073741824, isUnsigned: true)
!163 = !DIEnumerator(name: "EPOLLET", value: 2147483648, isUnsigned: true)
!164 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MHD_ConnectionInfoType", file: !14, line: 2016, baseType: !15, size: 32, elements: !165)
!165 = !{!166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!166 = !DIEnumerator(name: "MHD_CONNECTION_INFO_CIPHER_ALGO", value: 0, isUnsigned: true)
!167 = !DIEnumerator(name: "MHD_CONNECTION_INFO_PROTOCOL", value: 1, isUnsigned: true)
!168 = !DIEnumerator(name: "MHD_CONNECTION_INFO_CLIENT_ADDRESS", value: 2, isUnsigned: true)
!169 = !DIEnumerator(name: "MHD_CONNECTION_INFO_GNUTLS_SESSION", value: 3, isUnsigned: true)
!170 = !DIEnumerator(name: "MHD_CONNECTION_INFO_GNUTLS_CLIENT_CERT", value: 4, isUnsigned: true)
!171 = !DIEnumerator(name: "MHD_CONNECTION_INFO_DAEMON", value: 5, isUnsigned: true)
!172 = !DIEnumerator(name: "MHD_CONNECTION_INFO_CONNECTION_FD", value: 6, isUnsigned: true)
!173 = !DIEnumerator(name: "MHD_CONNECTION_INFO_SOCKET_CONTEXT", value: 7, isUnsigned: true)
!174 = !DIEnumerator(name: "MHD_CONNECTION_INFO_CONNECTION_SUSPENDED", value: 8, isUnsigned: true)
!175 = !DIEnumerator(name: "MHD_CONNECTION_INFO_CONNECTION_TIMEOUT", value: 9, isUnsigned: true)
!176 = !DIEnumerator(name: "MHD_CONNECTION_INFO_REQUEST_HEADER_SIZE", value: 10, isUnsigned: true)
!177 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MHD_CONNECTION_OPTION", file: !14, line: 3894, baseType: !15, size: 32, elements: !178)
!178 = !{!179}
!179 = !DIEnumerator(name: "MHD_CONNECTION_OPTION_TIMEOUT", value: 0, isUnsigned: true)
!180 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MHD_ResponseMemoryMode", file: !14, line: 3135, baseType: !15, size: 32, elements: !181)
!181 = !{!182, !183, !184}
!182 = !DIEnumerator(name: "MHD_RESPMEM_PERSISTENT", value: 0, isUnsigned: true)
!183 = !DIEnumerator(name: "MHD_RESPMEM_MUST_FREE", value: 1, isUnsigned: true)
!184 = !DIEnumerator(name: "MHD_RESPMEM_MUST_COPY", value: 2, isUnsigned: true)
!185 = !{!186, !187, !8, !196, !200, !15, !6, !259, !531, !533, !534, !536}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MHD_HTTP_Header", file: !56, line: 313, size: 384, elements: !189)
!189 = !{!190, !191, !192, !193, !194, !195}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !188, file: !56, line: 318, baseType: !187, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !188, file: !56, line: 323, baseType: !6, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "header_size", scope: !188, file: !56, line: 328, baseType: !8, size: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !188, file: !56, line: 333, baseType: !6, size: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !188, file: !56, line: 338, baseType: !8, size: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !188, file: !56, line: 344, baseType: !79, size: 32, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !197, line: 27, baseType: !198)
!197 = !DIFile(filename: "/nix/store/9r0a3dipi8saq2zasp668zsk6qhqp5jb-glibc-2.32-48-dev/include/bits/stdint-uintn.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !199, line: 45, baseType: !10)
!199 = !DIFile(filename: "/nix/store/9r0a3dipi8saq2zasp668zsk6qhqp5jb-glibc-2.32-48-dev/include/bits/types.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "MHD_ConnectionInfo", file: !14, line: 1929, size: 64, elements: !203)
!203 = !{!204, !205, !206, !207, !208, !210, !211, !212, !213, !226, !530}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_algorithm", scope: !202, file: !14, line: 1935, baseType: !57, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !202, file: !14, line: 1940, baseType: !57, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "suspended", scope: !202, file: !14, line: 1945, baseType: !57, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "connection_timeout", scope: !202, file: !14, line: 1952, baseType: !15, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "connect_fd", scope: !202, file: !14, line: 1957, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_socket", file: !14, line: 193, baseType: !57)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "header_size", scope: !202, file: !14, line: 1962, baseType: !8, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "tls_session", scope: !202, file: !14, line: 1967, baseType: !186, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "client_cert", scope: !202, file: !14, line: 1972, baseType: !186, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "client_addr", scope: !202, file: !14, line: 1977, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !216, line: 178, size: 128, elements: !217)
!216 = !DIFile(filename: "/nix/store/9r0a3dipi8saq2zasp668zsk6qhqp5jb-glibc-2.32-48-dev/include/bits/socket.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!217 = !{!218, !222}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !215, file: !216, line: 180, baseType: !219, size: 16)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !220, line: 28, baseType: !221)
!220 = !DIFile(filename: "/nix/store/9r0a3dipi8saq2zasp668zsk6qhqp5jb-glibc-2.32-48-dev/include/bits/sockaddr.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!221 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !215, file: !216, line: 181, baseType: !223, size: 112, offset: 16)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 112, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 14)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "daemon", scope: !202, file: !14, line: 1983, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MHD_Daemon", file: !56, line: 1392, size: 4928, elements: !229)
!229 = !{!230, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !441, !442, !447, !448, !453, !454, !459, !460, !465, !466, !469, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !524, !525, !526, !527, !528, !529}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "default_handler", scope: !228, file: !56, line: 1398, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_AccessHandlerCallback", file: !14, line: 2227, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!13, !186, !235, !273, !273, !273, !273, !411, !412}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MHD_Connection", file: !56, line: 739, size: 3392, elements: !237)
!237 = !{!238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !334, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !358, !359, !360, !361, !362, !363, !364, !365, !366, !372, !373, !374, !378, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !407, !408, !409, !410}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "nextE", scope: !236, file: !56, line: 746, baseType: !235, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "prevE", scope: !236, file: !56, line: 751, baseType: !235, size: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !236, file: !56, line: 757, baseType: !235, size: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !236, file: !56, line: 762, baseType: !235, size: 64, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "nextX", scope: !236, file: !56, line: 771, baseType: !235, size: 64, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "prevX", scope: !236, file: !56, line: 776, baseType: !235, size: 64, offset: 320)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "daemon", scope: !236, file: !56, line: 781, baseType: !227, size: 64, offset: 384)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "headers_received", scope: !236, file: !56, line: 786, baseType: !187, size: 64, offset: 448)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "headers_received_tail", scope: !236, file: !56, line: 791, baseType: !187, size: 64, offset: 512)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "response", scope: !236, file: !56, line: 796, baseType: !248, size: 64, offset: 576)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MHD_Response", file: !56, line: 406, size: 1344, elements: !250)
!250 = !{!251, !252, !253, !254, !263, !268, !283, !284, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !333}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "first_header", scope: !249, file: !56, line: 414, baseType: !187, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !249, file: !56, line: 420, baseType: !6, size: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "crc_cls", scope: !249, file: !56, line: 426, baseType: !186, size: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !249, file: !56, line: 432, baseType: !255, size: 64, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_ContentReaderCallback", file: !14, line: 2376, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!259, !186, !196, !6, !8}
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !260, line: 77, baseType: !261)
!260 = !DIFile(filename: "/nix/store/9r0a3dipi8saq2zasp668zsk6qhqp5jb-glibc-2.32-48-dev/include/stdio.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !199, line: 194, baseType: !262)
!262 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "crfc", scope: !249, file: !56, line: 438, baseType: !264, size: 64, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_ContentReaderFreeCallback", file: !14, line: 2392, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !186}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "upgrade_handler", scope: !249, file: !56, line: 446, baseType: !269, size: 64, offset: 320)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_UpgradeHandler", file: !14, line: 3429, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !186, !235, !186, !273, !8, !209, !275}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MHD_UpgradeResponseHandle", file: !56, line: 1217, size: 128, elements: !277)
!277 = !{!278, !279, !282}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !276, file: !56, line: 1224, baseType: !235, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "was_closed", scope: !276, file: !56, line: 1329, baseType: !280, size: 8, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !281)
!281 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "clean_ready", scope: !276, file: !56, line: 1352, baseType: !280, size: 8, offset: 72)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "upgrade_handler_cls", scope: !249, file: !56, line: 451, baseType: !186, size: 64, offset: 384)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !249, file: !56, line: 459, baseType: !285, size: 320, offset: 448)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_mutex_", file: !286, line: 70, baseType: !287)
!286 = !DIFile(filename: "src/microhttpd/mhd_locks.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !288, line: 72, baseType: !289)
!288 = !DIFile(filename: "/nix/store/9r0a3dipi8saq2zasp668zsk6qhqp5jb-glibc-2.32-48-dev/include/bits/pthreadtypes.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!289 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !288, line: 67, size: 320, elements: !290)
!290 = !{!291, !311, !315}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !289, file: !288, line: 69, baseType: !292, size: 320)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !293, line: 22, size: 320, elements: !294)
!293 = !DIFile(filename: "/nix/store/9r0a3dipi8saq2zasp668zsk6qhqp5jb-glibc-2.32-48-dev/include/bits/struct_mutex.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!294 = !{!295, !296, !297, !298, !299, !300, !302, !303}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !292, file: !293, line: 24, baseType: !57, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !292, file: !293, line: 25, baseType: !15, size: 32, offset: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !292, file: !293, line: 26, baseType: !57, size: 32, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !292, file: !293, line: 28, baseType: !15, size: 32, offset: 96)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !292, file: !293, line: 32, baseType: !57, size: 32, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !292, file: !293, line: 34, baseType: !301, size: 16, offset: 160)
!301 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !292, file: !293, line: 35, baseType: !301, size: 16, offset: 176)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !292, file: !293, line: 36, baseType: !304, size: 128, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !305, line: 53, baseType: !306)
!305 = !DIFile(filename: "/nix/store/9r0a3dipi8saq2zasp668zsk6qhqp5jb-glibc-2.32-48-dev/include/bits/thread-shared-types.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !305, line: 49, size: 128, elements: !307)
!307 = !{!308, !310}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !306, file: !305, line: 51, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !306, file: !305, line: 52, baseType: !309, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !289, file: !288, line: 70, baseType: !312, size: 320)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 320, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 40)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !289, file: !288, line: 71, baseType: !262, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "total_size", scope: !249, file: !56, line: 465, baseType: !196, size: 64, offset: 768)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "data_start", scope: !249, file: !56, line: 471, baseType: !196, size: 64, offset: 832)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "fd_off", scope: !249, file: !56, line: 476, baseType: !196, size: 64, offset: 896)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !249, file: !56, line: 482, baseType: !8, size: 64, offset: 960)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "data_buffer_size", scope: !249, file: !56, line: 487, baseType: !8, size: 64, offset: 1024)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !249, file: !56, line: 493, baseType: !15, size: 32, offset: 1088)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !249, file: !56, line: 498, baseType: !57, size: 32, offset: 1120)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !249, file: !56, line: 503, baseType: !87, size: 32, offset: 1152)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "is_pipe", scope: !249, file: !56, line: 508, baseType: !281, size: 8, offset: 1184)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "data_iov", scope: !249, file: !56, line: 513, baseType: !326, size: 64, offset: 1216)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_iovec_", file: !56, line: 366, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !329, line: 26, size: 128, elements: !330)
!329 = !DIFile(filename: "/nix/store/9r0a3dipi8saq2zasp668zsk6qhqp5jb-glibc-2.32-48-dev/include/bits/types/struct_iovec.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!330 = !{!331, !332}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !328, file: !329, line: 28, baseType: !186, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !328, file: !329, line: 29, baseType: !8, size: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "data_iovcnt", scope: !249, file: !56, line: 518, baseType: !15, size: 32, offset: 1280)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !236, file: !56, line: 806, baseType: !335, size: 64, offset: 640)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryPool", file: !56, line: 806, flags: DIFlagFwdDecl)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "client_context", scope: !236, file: !56, line: 814, baseType: !186, size: 64, offset: 704)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "socket_context", scope: !236, file: !56, line: 823, baseType: !186, size: 64, offset: 768)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !236, file: !56, line: 828, baseType: !6, size: 64, offset: 832)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !236, file: !56, line: 834, baseType: !273, size: 64, offset: 896)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !236, file: !56, line: 840, baseType: !6, size: 64, offset: 960)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !236, file: !56, line: 847, baseType: !93, size: 32, offset: 1024)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "read_buffer", scope: !236, file: !56, line: 854, baseType: !6, size: 64, offset: 1088)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "write_buffer", scope: !236, file: !56, line: 860, baseType: !6, size: 64, offset: 1152)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !236, file: !56, line: 868, baseType: !6, size: 64, offset: 1216)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "colon", scope: !236, file: !56, line: 877, baseType: !6, size: 64, offset: 1280)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !236, file: !56, line: 883, baseType: !214, size: 64, offset: 1344)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !236, file: !56, line: 890, baseType: !349, size: 128, offset: 1408)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_thread_handle_ID_", file: !350, line: 127, baseType: !351)
!350 = !DIFile(filename: "src/microhttpd/mhd_threads.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MHD_thread_handle_ID_", file: !350, line: 122, size: 128, elements: !352)
!352 = !{!353, !356}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !351, file: !350, line: 124, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_thread_handle_", file: !350, line: 84, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !288, line: 27, baseType: !10)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !351, file: !350, line: 125, baseType: !357, size: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_thread_ID_", file: !350, line: 98, baseType: !355)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "read_buffer_size", scope: !236, file: !56, line: 899, baseType: !8, size: 64, offset: 1536)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "read_buffer_offset", scope: !236, file: !56, line: 905, baseType: !8, size: 64, offset: 1600)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "write_buffer_size", scope: !236, file: !56, line: 910, baseType: !8, size: 64, offset: 1664)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "write_buffer_send_offset", scope: !236, file: !56, line: 915, baseType: !8, size: 64, offset: 1728)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "write_buffer_append_offset", scope: !236, file: !56, line: 921, baseType: !8, size: 64, offset: 1792)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "header_size", scope: !236, file: !56, line: 927, baseType: !8, size: 64, offset: 1856)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "remaining_upload_size", scope: !236, file: !56, line: 933, baseType: !196, size: 64, offset: 1920)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "response_write_position", scope: !236, file: !56, line: 940, baseType: !196, size: 64, offset: 1984)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "resp_iov", scope: !236, file: !56, line: 948, baseType: !367, size: 192, offset: 2048)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MHD_iovec_track_", file: !56, line: 380, size: 192, elements: !368)
!368 = !{!369, !370, !371}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "iov", scope: !367, file: !56, line: 387, baseType: !326, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "cnt", scope: !367, file: !56, line: 393, baseType: !8, size: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !367, file: !56, line: 400, baseType: !8, size: 64, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "resp_sender", scope: !236, file: !56, line: 956, baseType: !98, size: 32, offset: 2240)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "continue_message_write_offset", scope: !236, file: !56, line: 963, baseType: !8, size: 64, offset: 2304)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "addr_len", scope: !236, file: !56, line: 968, baseType: !375, size: 32, offset: 2368)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !376, line: 274, baseType: !377)
!376 = !DIFile(filename: "/nix/store/9r0a3dipi8saq2zasp668zsk6qhqp5jb-glibc-2.32-48-dev/include/unistd.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !199, line: 210, baseType: !15)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "last_activity", scope: !236, file: !56, line: 974, baseType: !379, size: 64, offset: 2432)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !380, line: 7, baseType: !381)
!380 = !DIFile(filename: "/nix/store/9r0a3dipi8saq2zasp668zsk6qhqp5jb-glibc-2.32-48-dev/include/bits/types/time_t.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !199, line: 160, baseType: !262)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "connection_timeout", scope: !236, file: !56, line: 980, baseType: !379, size: 64, offset: 2496)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "connection_timeout_dummy", scope: !236, file: !56, line: 985, baseType: !15, size: 32, offset: 2560)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "client_aware", scope: !236, file: !56, line: 992, baseType: !281, size: 8, offset: 2592)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "socket_fd", scope: !236, file: !56, line: 999, baseType: !209, size: 32, offset: 2624)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "is_nonip", scope: !236, file: !56, line: 1005, baseType: !55, size: 32, offset: 2656)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "sk_nonblck", scope: !236, file: !56, line: 1010, baseType: !281, size: 8, offset: 2688)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "sk_spipe_suppress", scope: !236, file: !56, line: 1015, baseType: !281, size: 8, offset: 2696)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "sk_corked", scope: !236, file: !56, line: 1020, baseType: !55, size: 32, offset: 2720)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "sk_nodelay", scope: !236, file: !56, line: 1025, baseType: !55, size: 32, offset: 2752)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "read_closed", scope: !236, file: !56, line: 1033, baseType: !281, size: 8, offset: 2784)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "thread_joined", scope: !236, file: !56, line: 1039, baseType: !281, size: 8, offset: 2792)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "in_idle", scope: !236, file: !56, line: 1046, baseType: !281, size: 8, offset: 2800)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "in_cleanup", scope: !236, file: !56, line: 1052, baseType: !281, size: 8, offset: 2808)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_state", scope: !236, file: !56, line: 1058, baseType: !102, size: 32, offset: 2816)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !236, file: !56, line: 1064, baseType: !111, size: 32, offset: 2848)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "event_loop_info", scope: !236, file: !56, line: 1069, baseType: !134, size: 32, offset: 2880)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "responseCode", scope: !236, file: !56, line: 1075, baseType: !15, size: 32, offset: 2912)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "have_chunked_upload", scope: !236, file: !56, line: 1084, baseType: !281, size: 8, offset: 2944)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "current_chunk_size", scope: !236, file: !56, line: 1092, baseType: !196, size: 64, offset: 3008)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "current_chunk_offset", scope: !236, file: !56, line: 1098, baseType: !196, size: 64, offset: 3072)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "recv_cls", scope: !236, file: !56, line: 1103, baseType: !403, size: 64, offset: 3136)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "ReceiveCallback", file: !56, line: 695, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!259, !235, !186, !8}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "urh", scope: !236, file: !56, line: 1112, baseType: !275, size: 64, offset: 3200)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "suspended", scope: !236, file: !56, line: 1147, baseType: !281, size: 8, offset: 3264)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "suspended_dummy", scope: !236, file: !56, line: 1152, baseType: !57, size: 32, offset: 3296)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "resuming", scope: !236, file: !56, line: 1157, baseType: !280, size: 8, offset: 3328)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "default_handler_cls", scope: !228, file: !56, line: 1403, baseType: !186, size: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !228, file: !56, line: 1411, baseType: !19, size: 32, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "new_connections_head", scope: !228, file: !56, line: 1416, baseType: !235, size: 64, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "new_connections_tail", scope: !228, file: !56, line: 1421, baseType: !235, size: 64, offset: 256)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "connections_head", scope: !228, file: !56, line: 1426, baseType: !235, size: 64, offset: 320)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "connections_tail", scope: !228, file: !56, line: 1431, baseType: !235, size: 64, offset: 384)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "suspended_connections_head", scope: !228, file: !56, line: 1436, baseType: !235, size: 64, offset: 448)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "suspended_connections_tail", scope: !228, file: !56, line: 1441, baseType: !235, size: 64, offset: 512)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup_head", scope: !228, file: !56, line: 1446, baseType: !235, size: 64, offset: 576)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup_tail", scope: !228, file: !56, line: 1451, baseType: !235, size: 64, offset: 640)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "listen_is_unix", scope: !228, file: !56, line: 1456, baseType: !55, size: 32, offset: 704)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "eready_head", scope: !228, file: !56, line: 1462, baseType: !235, size: 64, offset: 768)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "eready_tail", scope: !228, file: !56, line: 1467, baseType: !235, size: 64, offset: 832)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !228, file: !56, line: 1475, baseType: !57, size: 32, offset: 896)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "listen_socket_in_epoll", scope: !228, file: !56, line: 1481, baseType: !281, size: 8, offset: 928)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "eready_urh_head", scope: !228, file: !56, line: 1501, baseType: !275, size: 64, offset: 960)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "eready_urh_tail", scope: !228, file: !56, line: 1506, baseType: !275, size: 64, offset: 1024)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "normal_timeout_head", scope: !228, file: !56, line: 1524, baseType: !235, size: 64, offset: 1088)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "normal_timeout_tail", scope: !228, file: !56, line: 1531, baseType: !235, size: 64, offset: 1152)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "manual_timeout_head", scope: !228, file: !56, line: 1539, baseType: !235, size: 64, offset: 1216)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "manual_timeout_tail", scope: !228, file: !56, line: 1546, baseType: !235, size: 64, offset: 1280)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "apc", scope: !228, file: !56, line: 1552, baseType: !435, size: 64, offset: 1344)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_AcceptPolicyCallback", file: !14, line: 2182, baseType: !436)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!13, !186, !439, !375}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !215)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "apc_cls", scope: !228, file: !56, line: 1557, baseType: !186, size: 64, offset: 1408)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "notify_completed", scope: !228, file: !56, line: 1563, baseType: !443, size: 64, offset: 1472)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_RequestCompletedCallback", file: !14, line: 2250, baseType: !444)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !186, !235, !412, !64}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "notify_completed_cls", scope: !228, file: !56, line: 1568, baseType: !186, size: 64, offset: 1536)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "notify_connection", scope: !228, file: !56, line: 1574, baseType: !449, size: 64, offset: 1600)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_NotifyConnectionCallback", file: !14, line: 2276, baseType: !450)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{null, !186, !235, !412, !72}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "notify_connection_cls", scope: !228, file: !56, line: 1579, baseType: !186, size: 64, offset: 1664)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "uri_log_callback", scope: !228, file: !56, line: 1588, baseType: !455, size: 64, offset: 1728)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "LogCallback", file: !56, line: 1366, baseType: !456)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{!186, !186, !273, !235}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "uri_log_callback_cls", scope: !228, file: !56, line: 1593, baseType: !186, size: 64, offset: 1792)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "unescape_callback", scope: !228, file: !56, line: 1598, baseType: !461, size: 64, offset: 1856)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "UnescapeCallback", file: !56, line: 1380, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!8, !186, !235, !6}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "unescape_callback_cls", scope: !228, file: !56, line: 1603, baseType: !186, size: 64, offset: 1920)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !228, file: !56, line: 1611, baseType: !467, size: 16, offset: 1984)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !197, line: 25, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !199, line: 40, baseType: !221)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "custom_error_log", scope: !228, file: !56, line: 1618, baseType: !470, size: 64, offset: 2048)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_LogCallback", file: !14, line: 1349, baseType: !471)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{null, !186, !273, !474}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !476)
!476 = !{!477, !478, !479, !480}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !475, file: !3, baseType: !15, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !475, file: !3, baseType: !15, size: 32, offset: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !475, file: !3, baseType: !186, size: 64, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !475, file: !3, baseType: !186, size: 64, offset: 128)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "custom_error_log_cls", scope: !228, file: !56, line: 1623, baseType: !186, size: 64, offset: 2112)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !228, file: !56, line: 1629, baseType: !227, size: 64, offset: 2176)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "listen_fd", scope: !228, file: !56, line: 1637, baseType: !209, size: 32, offset: 2240)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "worker_pool", scope: !228, file: !56, line: 1643, baseType: !227, size: 64, offset: 2304)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "per_ip_connection_count", scope: !228, file: !56, line: 1649, baseType: !186, size: 64, offset: 2368)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !228, file: !56, line: 1657, baseType: !15, size: 32, offset: 2432)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !228, file: !56, line: 1662, baseType: !8, size: 64, offset: 2496)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "pool_increment", scope: !228, file: !56, line: 1667, baseType: !8, size: 64, offset: 2560)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "thread_stack_size", scope: !228, file: !56, line: 1673, baseType: !8, size: 64, offset: 2624)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "worker_pool_size", scope: !228, file: !56, line: 1678, baseType: !15, size: 32, offset: 2688)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !228, file: !56, line: 1683, baseType: !349, size: 128, offset: 2752)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "per_ip_connection_mutex", scope: !228, file: !56, line: 1688, baseType: !285, size: 320, offset: 2880)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup_connection_mutex", scope: !228, file: !56, line: 1694, baseType: !285, size: 320, offset: 3200)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "new_connections_mutex", scope: !228, file: !56, line: 1699, baseType: !285, size: 320, offset: 3520)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "insanity_level", scope: !228, file: !56, line: 1706, baseType: !76, size: 32, offset: 3840)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "listening_address_reuse", scope: !228, file: !56, line: 1717, baseType: !57, size: 32, offset: 3872)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "itc", scope: !228, file: !56, line: 1724, baseType: !498, size: 32, offset: 3904)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MHD_itc_", file: !499, line: 45, size: 32, elements: !500)
!499 = !DIFile(filename: "src/microhttpd/mhd_itc_types.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!500 = !{!501}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !498, file: !499, line: 47, baseType: !57, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !228, file: !56, line: 1729, baseType: !280, size: 8, offset: 3936)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "was_quiesced", scope: !228, file: !56, line: 1736, baseType: !280, size: 8, offset: 3944)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "at_limit", scope: !228, file: !56, line: 1745, baseType: !281, size: 8, offset: 3952)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "resuming", scope: !228, file: !56, line: 1750, baseType: !280, size: 8, offset: 3960)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "have_new", scope: !228, file: !56, line: 1756, baseType: !280, size: 8, offset: 3968)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "data_already_pending", scope: !228, file: !56, line: 1767, baseType: !281, size: 8, offset: 3976)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "connection_limit", scope: !228, file: !56, line: 1772, baseType: !15, size: 32, offset: 4000)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "connection_timeout", scope: !228, file: !56, line: 1778, baseType: !379, size: 64, offset: 4032)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "per_ip_connection_limit", scope: !228, file: !56, line: 1784, baseType: !15, size: 32, offset: 4096)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "strict_for_client", scope: !228, file: !56, line: 1789, baseType: !57, size: 32, offset: 4128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "sigpipe_blocked", scope: !228, file: !56, line: 1794, baseType: !281, size: 8, offset: 4160)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "digest_auth_random", scope: !228, file: !56, line: 1907, baseType: !273, size: 64, offset: 4224)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "nnc", scope: !228, file: !56, line: 1912, baseType: !515, size: 64, offset: 4288)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MHD_NonceNc", file: !56, line: 275, size: 1216, elements: !517)
!517 = !{!518, !519, !520}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !516, file: !56, line: 282, baseType: !196, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "nmask", scope: !516, file: !56, line: 288, baseType: !196, size: 64, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "nonce", scope: !516, file: !56, line: 293, baseType: !521, size: 1032, offset: 128)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1032, elements: !522)
!522 = !{!523}
!523 = !DISubrange(count: 129)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "nnc_lock", scope: !228, file: !56, line: 1918, baseType: !285, size: 320, offset: 4352)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "digest_auth_rand_size", scope: !228, file: !56, line: 1924, baseType: !8, size: 64, offset: 4672)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "nonce_nc_size", scope: !228, file: !56, line: 1929, baseType: !15, size: 32, offset: 4736)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "fastopen_queue_size", scope: !228, file: !56, line: 1937, baseType: !15, size: 32, offset: 4768)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "listen_backlog_size", scope: !228, file: !56, line: 1943, baseType: !15, size: 32, offset: 4800)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "num_opts", scope: !228, file: !56, line: 1952, baseType: !8, size: 64, offset: 4864)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "socket_context", scope: !202, file: !14, line: 1989, baseType: !186, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !197, line: 26, baseType: !532)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !199, line: 42, baseType: !15)
!533 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_SCKT_SEND_SIZE_", file: !537, line: 296, baseType: !8)
!537 = !DIFile(filename: "src/microhttpd/mhd_sockets.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!538 = !{!539, !0, !554, !560}
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "small_inc", scope: !541, file: !3, line: 1217, type: !553, isLocal: true, isDefinition: true)
!541 = distinct !DISubprogram(name: "try_grow_read_buffer", scope: !3, file: !3, line: 1193, type: !542, isLocal: true, isDefinition: true, scopeLine: 1195, flags: DIFlagPrototyped, isOptimized: true, unit: !11, retainedNodes: !544)
!542 = !DISubroutineType(types: !543)
!543 = !{!281, !235, !281}
!544 = !{!545, !546, !547, !548, !549, !550}
!545 = !DILocalVariable(name: "connection", arg: 1, scope: !541, file: !3, line: 1193, type: !235)
!546 = !DILocalVariable(name: "required", arg: 2, scope: !541, file: !3, line: 1194, type: !281)
!547 = !DILocalVariable(name: "new_size", scope: !541, file: !3, line: 1196, type: !8)
!548 = !DILocalVariable(name: "avail_size", scope: !541, file: !3, line: 1197, type: !8)
!549 = !DILocalVariable(name: "rb", scope: !541, file: !3, line: 1198, type: !186)
!550 = !DILocalVariable(name: "grow_size", scope: !551, file: !3, line: 1207, type: !8)
!551 = distinct !DILexicalBlock(scope: !552, file: !3, line: 1206, column: 3)
!552 = distinct !DILexicalBlock(scope: !541, file: !3, line: 1203, column: 7)
!553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "mons", scope: !2, file: !3, line: 1136, type: !556, isLocal: true, isDefinition: true)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !557, size: 768, elements: !558)
!557 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !273)
!558 = !{!559}
!559 = !DISubrange(count: 12)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "_MHD_itc_wr_data", scope: !11, file: !562, line: 78, type: !563, isLocal: true, isDefinition: true)
!562 = !DIFile(filename: "src/microhttpd/mhd_itc.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!563 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !196)
!564 = !{!565, !566, !567, !582}
!565 = !DILocalVariable(name: "date", arg: 1, scope: !2, file: !3, line: 1130, type: !6)
!566 = !DILocalVariable(name: "date_len", arg: 2, scope: !2, file: !3, line: 1131, type: !8)
!567 = !DILocalVariable(name: "now", scope: !2, file: !3, line: 1140, type: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !569, line: 7, size: 448, elements: !570)
!569 = !DIFile(filename: "/nix/store/9r0a3dipi8saq2zasp668zsk6qhqp5jb-glibc-2.32-48-dev/include/bits/types/struct_tm.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!570 = !{!571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !568, file: !569, line: 9, baseType: !57, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !568, file: !569, line: 10, baseType: !57, size: 32, offset: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !568, file: !569, line: 11, baseType: !57, size: 32, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !568, file: !569, line: 12, baseType: !57, size: 32, offset: 96)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !568, file: !569, line: 13, baseType: !57, size: 32, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !568, file: !569, line: 14, baseType: !57, size: 32, offset: 160)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !568, file: !569, line: 15, baseType: !57, size: 32, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !568, file: !569, line: 16, baseType: !57, size: 32, offset: 224)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !568, file: !569, line: 17, baseType: !57, size: 32, offset: 256)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !568, file: !569, line: 20, baseType: !262, size: 64, offset: 320)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !568, file: !569, line: 21, baseType: !273, size: 64, offset: 384)
!582 = !DILocalVariable(name: "t", scope: !2, file: !3, line: 1141, type: !379)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !557, size: 448, elements: !584)
!584 = !{!585}
!585 = !DISubrange(count: 7)
!586 = !{i32 2, !"Dwarf Version", i32 4}
!587 = !{i32 2, !"Debug Info Version", i32 3}
!588 = !{i32 1, !"wchar_size", i32 4}
!589 = !{i32 7, !"PIC Level", i32 2}
!590 = !{!"clang version 7.1.0 (tags/RELEASE_710/final)"}
!591 = distinct !DISubprogram(name: "MHD_get_connection_values", scope: !3, file: !3, line: 246, type: !592, isLocal: false, isDefinition: true, scopeLine: 250, flags: DIFlagPrototyped, isOptimized: true, unit: !11, retainedNodes: !598)
!592 = !DISubroutineType(types: !593)
!593 = !{!57, !235, !79, !594, !186}
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_KeyValueIterator", file: !14, line: 2298, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!13, !186, !79, !273, !273}
!598 = !{!599, !600, !601, !602, !603, !604}
!599 = !DILocalVariable(name: "connection", arg: 1, scope: !591, file: !3, line: 246, type: !235)
!600 = !DILocalVariable(name: "kind", arg: 2, scope: !591, file: !3, line: 247, type: !79)
!601 = !DILocalVariable(name: "iterator", arg: 3, scope: !591, file: !3, line: 248, type: !594)
!602 = !DILocalVariable(name: "iterator_cls", arg: 4, scope: !591, file: !3, line: 249, type: !186)
!603 = !DILocalVariable(name: "ret", scope: !591, file: !3, line: 251, type: !57)
!604 = !DILocalVariable(name: "pos", scope: !591, file: !3, line: 252, type: !187)
!605 = !DILocation(line: 246, column: 51, scope: !591)
!606 = !DILocation(line: 247, column: 47, scope: !591)
!607 = !DILocation(line: 248, column: 49, scope: !591)
!608 = !DILocation(line: 249, column: 34, scope: !591)
!609 = !DILocation(line: 254, column: 12, scope: !610)
!610 = distinct !DILexicalBlock(scope: !591, file: !3, line: 254, column: 7)
!611 = !DILocation(line: 254, column: 7, scope: !591)
!612 = !DILocation(line: 251, column: 7, scope: !591)
!613 = !DILocation(line: 257, column: 26, scope: !614)
!614 = distinct !DILexicalBlock(scope: !591, file: !3, line: 257, column: 3)
!615 = !DILocation(line: 252, column: 27, scope: !591)
!616 = !DILocation(line: 0, scope: !617)
!617 = distinct !DILexicalBlock(scope: !614, file: !3, line: 257, column: 3)
!618 = !{!619, !619, i64 0}
!619 = !{!"any pointer", !620, i64 0}
!620 = !{!"omnipotent char", !621, i64 0}
!621 = !{!"Simple C/C++ TBAA"}
!622 = !DILocation(line: 257, column: 49, scope: !617)
!623 = !DILocation(line: 257, column: 3, scope: !614)
!624 = !DILocation(line: 258, column: 20, scope: !625)
!625 = distinct !DILexicalBlock(scope: !617, file: !3, line: 258, column: 9)
!626 = !{!627, !620, i64 40}
!627 = !{!"MHD_HTTP_Header", !619, i64 0, !619, i64 8, !628, i64 16, !619, i64 24, !628, i64 32, !620, i64 40}
!628 = !{!"long", !620, i64 0}
!629 = !DILocation(line: 258, column: 25, scope: !625)
!630 = !DILocation(line: 258, column: 11, scope: !625)
!631 = !DILocation(line: 258, column: 9, scope: !617)
!632 = !DILocation(line: 260, column: 10, scope: !633)
!633 = distinct !DILexicalBlock(scope: !625, file: !3, line: 259, column: 5)
!634 = !DILocation(line: 261, column: 31, scope: !635)
!635 = distinct !DILexicalBlock(scope: !633, file: !3, line: 261, column: 12)
!636 = !DILocation(line: 264, column: 38, scope: !635)
!637 = !{!627, !619, i64 8}
!638 = !DILocation(line: 265, column: 38, scope: !635)
!639 = !{!627, !619, i64 24}
!640 = !DILocation(line: 262, column: 23, scope: !635)
!641 = !DILocation(line: 262, column: 20, scope: !635)
!642 = !DILocation(line: 261, column: 12, scope: !633)
!643 = !DILocation(line: 0, scope: !591)
!644 = !DILocation(line: 257, column: 68, scope: !617)
!645 = distinct !{!645, !623, !646}
!646 = !DILocation(line: 267, column: 5, scope: !614)
!647 = !DILocation(line: 269, column: 1, scope: !591)
!648 = distinct !DISubprogram(name: "MHD_get_connection_values_n", scope: !3, file: !3, line: 285, type: !649, isLocal: false, isDefinition: true, scopeLine: 289, flags: DIFlagPrototyped, isOptimized: true, unit: !11, retainedNodes: !655)
!649 = !DISubroutineType(types: !650)
!650 = !{!57, !235, !79, !651, !186}
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_KeyValueIteratorN", file: !14, line: 2323, baseType: !652)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!13, !186, !79, !273, !8, !273, !8}
!655 = !{!656, !657, !658, !659, !660, !661}
!656 = !DILocalVariable(name: "connection", arg: 1, scope: !648, file: !3, line: 285, type: !235)
!657 = !DILocalVariable(name: "kind", arg: 2, scope: !648, file: !3, line: 286, type: !79)
!658 = !DILocalVariable(name: "iterator", arg: 3, scope: !648, file: !3, line: 287, type: !651)
!659 = !DILocalVariable(name: "iterator_cls", arg: 4, scope: !648, file: !3, line: 288, type: !186)
!660 = !DILocalVariable(name: "ret", scope: !648, file: !3, line: 290, type: !57)
!661 = !DILocalVariable(name: "pos", scope: !648, file: !3, line: 291, type: !187)
!662 = !DILocation(line: 285, column: 53, scope: !648)
!663 = !DILocation(line: 286, column: 49, scope: !648)
!664 = !DILocation(line: 287, column: 52, scope: !648)
!665 = !DILocation(line: 288, column: 36, scope: !648)
!666 = !DILocation(line: 293, column: 12, scope: !667)
!667 = distinct !DILexicalBlock(scope: !648, file: !3, line: 293, column: 7)
!668 = !DILocation(line: 293, column: 7, scope: !648)
!669 = !DILocation(line: 290, column: 7, scope: !648)
!670 = !DILocation(line: 297, column: 12, scope: !671)
!671 = distinct !DILexicalBlock(scope: !648, file: !3, line: 297, column: 7)
!672 = !DILocation(line: 0, scope: !673)
!673 = distinct !DILexicalBlock(scope: !671, file: !3, line: 304, column: 5)
!674 = !{!675, !619, i64 56}
!675 = !{!"MHD_Connection", !619, i64 0, !619, i64 8, !619, i64 16, !619, i64 24, !619, i64 32, !619, i64 40, !619, i64 48, !619, i64 56, !619, i64 64, !619, i64 72, !619, i64 80, !619, i64 88, !619, i64 96, !619, i64 104, !619, i64 112, !619, i64 120, !620, i64 128, !619, i64 136, !619, i64 144, !619, i64 152, !619, i64 160, !619, i64 168, !676, i64 176, !628, i64 192, !628, i64 200, !628, i64 208, !628, i64 216, !628, i64 224, !628, i64 232, !628, i64 240, !628, i64 248, !677, i64 256, !620, i64 280, !628, i64 288, !678, i64 296, !628, i64 304, !628, i64 312, !678, i64 320, !679, i64 324, !678, i64 328, !620, i64 332, !679, i64 336, !679, i64 337, !620, i64 340, !620, i64 344, !679, i64 348, !679, i64 349, !679, i64 350, !679, i64 351, !620, i64 352, !620, i64 356, !620, i64 360, !678, i64 364, !679, i64 368, !628, i64 376, !628, i64 384, !619, i64 392, !619, i64 400, !679, i64 408, !678, i64 412, !679, i64 416}
!676 = !{!"_MHD_thread_handle_ID_", !628, i64 0, !628, i64 8}
!677 = !{!"MHD_iovec_track_", !619, i64 0, !628, i64 8, !628, i64 16}
!678 = !{!"int", !620, i64 0}
!679 = !{!"_Bool", !620, i64 0}
!680 = !DILocation(line: 291, column: 27, scope: !648)
!681 = !DILocation(line: 0, scope: !682)
!682 = distinct !DILexicalBlock(scope: !673, file: !3, line: 304, column: 5)
!683 = !DILocation(line: 297, column: 7, scope: !648)
!684 = !DILocation(line: 304, column: 5, scope: !673)
!685 = !DILocation(line: 298, column: 5, scope: !686)
!686 = distinct !DILexicalBlock(scope: !671, file: !3, line: 298, column: 5)
!687 = !DILocation(line: 300, column: 29, scope: !688)
!688 = distinct !DILexicalBlock(scope: !689, file: !3, line: 300, column: 11)
!689 = distinct !DILexicalBlock(scope: !690, file: !3, line: 299, column: 5)
!690 = distinct !DILexicalBlock(scope: !686, file: !3, line: 298, column: 5)
!691 = !DILocation(line: 300, column: 22, scope: !688)
!692 = !DILocation(line: 300, column: 13, scope: !688)
!693 = !DILocation(line: 300, column: 11, scope: !689)
!694 = !DILocation(line: 298, column: 70, scope: !690)
!695 = !{!627, !619, i64 0}
!696 = !DILocation(line: 298, column: 51, scope: !690)
!697 = distinct !{!697, !685, !698}
!698 = !DILocation(line: 302, column: 5, scope: !686)
!699 = !DILocation(line: 305, column: 29, scope: !700)
!700 = distinct !DILexicalBlock(scope: !682, file: !3, line: 305, column: 11)
!701 = !DILocation(line: 305, column: 22, scope: !700)
!702 = !DILocation(line: 305, column: 13, scope: !700)
!703 = !DILocation(line: 305, column: 11, scope: !682)
!704 = !DILocation(line: 307, column: 12, scope: !705)
!705 = distinct !DILexicalBlock(scope: !700, file: !3, line: 306, column: 7)
!706 = !DILocation(line: 310, column: 38, scope: !707)
!707 = distinct !DILexicalBlock(scope: !705, file: !3, line: 308, column: 13)
!708 = !DILocation(line: 311, column: 38, scope: !707)
!709 = !{!627, !628, i64 16}
!710 = !DILocation(line: 312, column: 38, scope: !707)
!711 = !DILocation(line: 313, column: 38, scope: !707)
!712 = !{!627, !628, i64 32}
!713 = !DILocation(line: 308, column: 23, scope: !707)
!714 = !DILocation(line: 308, column: 20, scope: !707)
!715 = !DILocation(line: 308, column: 13, scope: !705)
!716 = !DILocation(line: 0, scope: !648)
!717 = !DILocation(line: 304, column: 70, scope: !682)
!718 = !DILocation(line: 304, column: 51, scope: !682)
!719 = distinct !{!719, !684, !720}
!720 = !DILocation(line: 315, column: 7, scope: !673)
!721 = !DILocation(line: 0, scope: !707)
!722 = !DILocation(line: 317, column: 1, scope: !648)
!723 = distinct !DISubprogram(name: "MHD_pool_allocate_header", scope: !3, file: !3, line: 319, type: !724, isLocal: false, isDefinition: true, scopeLine: 321, flags: DIFlagPrototyped, isOptimized: true, unit: !11, retainedNodes: !726)
!724 = !DISubroutineType(types: !725)
!725 = !{!187, !235}
!726 = !{!727}
!727 = !DILocalVariable(name: "connection", arg: 1, scope: !723, file: !3, line: 319, type: !235)
!728 = !DILocation(line: 319, column: 101, scope: !723)
!729 = !DILocation(line: 322, column: 67, scope: !723)
!730 = !{!675, !619, i64 80}
!731 = !DILocation(line: 322, column: 37, scope: !723)
!732 = !DILocation(line: 322, column: 10, scope: !723)
!733 = !DILocation(line: 322, column: 3, scope: !723)
!734 = distinct !DISubprogram(name: "MHD_set_connection_value_n", scope: !3, file: !3, line: 408, type: !735, isLocal: false, isDefinition: true, scopeLine: 414, flags: DIFlagPrototyped, isOptimized: true, unit: !11, retainedNodes: !737)
!735 = !DISubroutineType(types: !736)
!736 = !{!13, !235, !79, !273, !8, !273, !8}
!737 = !{!738, !739, !740, !741, !742, !743}
!738 = !DILocalVariable(name: "connection", arg: 1, scope: !734, file: !3, line: 408, type: !235)
!739 = !DILocalVariable(name: "kind", arg: 2, scope: !734, file: !3, line: 409, type: !79)
!740 = !DILocalVariable(name: "key", arg: 3, scope: !734, file: !3, line: 410, type: !273)
!741 = !DILocalVariable(name: "key_size", arg: 4, scope: !734, file: !3, line: 411, type: !8)
!742 = !DILocalVariable(name: "value", arg: 5, scope: !734, file: !3, line: 412, type: !273)
!743 = !DILocalVariable(name: "value_size", arg: 6, scope: !734, file: !3, line: 413, type: !8)
!744 = !DILocation(line: 408, column: 52, scope: !734)
!745 = !DILocation(line: 409, column: 48, scope: !734)
!746 = !DILocation(line: 410, column: 41, scope: !734)
!747 = !DILocation(line: 411, column: 36, scope: !734)
!748 = !DILocation(line: 412, column: 41, scope: !734)
!749 = !DILocation(line: 413, column: 36, scope: !734)
!750 = !DILocation(line: 415, column: 31, scope: !751)
!751 = distinct !DILexicalBlock(scope: !734, file: !3, line: 415, column: 8)
!752 = !DILocation(line: 415, column: 40, scope: !751)
!753 = !DILocation(line: 416, column: 12, scope: !751)
!754 = !DILocation(line: 416, column: 18, scope: !751)
!755 = !DILocation(line: 416, column: 36, scope: !751)
!756 = !DILocation(line: 416, column: 49, scope: !751)
!757 = !DILocation(line: 417, column: 12, scope: !751)
!758 = !DILocation(line: 417, column: 20, scope: !751)
!759 = !DILocation(line: 417, column: 40, scope: !751)
!760 = !DILocation(line: 415, column: 8, scope: !734)
!761 = !DILocalVariable(name: "connection", arg: 1, scope: !762, file: !3, line: 343, type: !235)
!762 = distinct !DISubprogram(name: "MHD_set_connection_value_n_nocheck_", scope: !3, file: !3, line: 343, type: !735, isLocal: true, isDefinition: true, scopeLine: 349, flags: DIFlagPrototyped, isOptimized: true, unit: !11, retainedNodes: !763)
!763 = !{!761, !764, !765, !766, !767, !768, !769}
!764 = !DILocalVariable(name: "kind", arg: 2, scope: !762, file: !3, line: 344, type: !79)
!765 = !DILocalVariable(name: "key", arg: 3, scope: !762, file: !3, line: 345, type: !273)
!766 = !DILocalVariable(name: "key_size", arg: 4, scope: !762, file: !3, line: 346, type: !8)
!767 = !DILocalVariable(name: "value", arg: 5, scope: !762, file: !3, line: 347, type: !273)
!768 = !DILocalVariable(name: "value_size", arg: 6, scope: !762, file: !3, line: 348, type: !8)
!769 = !DILocalVariable(name: "pos", scope: !762, file: !3, line: 350, type: !187)
!770 = !DILocation(line: 343, column: 61, scope: !762, inlinedAt: !771)
!771 = distinct !DILocation(line: 420, column: 10, scope: !734)
!772 = !DILocation(line: 344, column: 57, scope: !762, inlinedAt: !771)
!773 = !DILocation(line: 345, column: 50, scope: !762, inlinedAt: !771)
!774 = !DILocation(line: 346, column: 45, scope: !762, inlinedAt: !771)
!775 = !DILocation(line: 347, column: 50, scope: !762, inlinedAt: !771)
!776 = !DILocation(line: 348, column: 45, scope: !762, inlinedAt: !771)
!777 = !DILocation(line: 356, column: 9, scope: !762, inlinedAt: !771)
!778 = !DILocation(line: 350, column: 27, scope: !762, inlinedAt: !771)
!779 = !DILocation(line: 361, column: 8, scope: !762, inlinedAt: !771)
!780 = !DILocation(line: 361, column: 15, scope: !762, inlinedAt: !771)
!781 = !DILocation(line: 362, column: 8, scope: !762, inlinedAt: !771)
!782 = !DILocation(line: 362, column: 20, scope: !762, inlinedAt: !771)
!783 = !DILocation(line: 363, column: 8, scope: !762, inlinedAt: !771)
!784 = !DILocation(line: 363, column: 14, scope: !762, inlinedAt: !771)
!785 = !DILocation(line: 364, column: 8, scope: !762, inlinedAt: !771)
!786 = !DILocation(line: 364, column: 19, scope: !762, inlinedAt: !771)
!787 = !DILocation(line: 365, column: 8, scope: !762, inlinedAt: !771)
!788 = !DILocation(line: 365, column: 13, scope: !762, inlinedAt: !771)
!789 = !DILocation(line: 366, column: 8, scope: !762, inlinedAt: !771)
!790 = !DILocation(line: 366, column: 13, scope: !762, inlinedAt: !771)
!791 = !DILocation(line: 368, column: 27, scope: !792, inlinedAt: !771)
!792 = distinct !DILexicalBlock(scope: !762, file: !3, line: 368, column: 7)
!793 = !{!675, !619, i64 64}
!794 = !DILocation(line: 368, column: 12, scope: !792, inlinedAt: !771)
!795 = !DILocation(line: 370, column: 17, scope: !796, inlinedAt: !771)
!796 = distinct !DILexicalBlock(scope: !792, file: !3, line: 369, column: 3)
!797 = !DILocation(line: 375, column: 40, scope: !798, inlinedAt: !771)
!798 = distinct !DILexicalBlock(scope: !792, file: !3, line: 374, column: 3)
!799 = !DILocation(line: 368, column: 7, scope: !762, inlinedAt: !771)
!800 = !DILocation(line: 0, scope: !734)
!801 = !DILocation(line: 0, scope: !796, inlinedAt: !771)
!802 = !DILocation(line: 420, column: 3, scope: !734)
!803 = !DILocation(line: 426, column: 1, scope: !734)
!804 = distinct !DISubprogram(name: "MHD_set_connection_value", scope: !3, file: !3, line: 455, type: !805, isLocal: false, isDefinition: true, scopeLine: 459, flags: DIFlagPrototyped, isOptimized: true, unit: !11, retainedNodes: !807)
!805 = !DISubroutineType(types: !806)
!806 = !{!13, !235, !79, !273, !273}
!807 = !{!808, !809, !810, !811}
!808 = !DILocalVariable(name: "connection", arg: 1, scope: !804, file: !3, line: 455, type: !235)
!809 = !DILocalVariable(name: "kind", arg: 2, scope: !804, file: !3, line: 456, type: !79)
!810 = !DILocalVariable(name: "key", arg: 3, scope: !804, file: !3, line: 457, type: !273)
!811 = !DILocalVariable(name: "value", arg: 4, scope: !804, file: !3, line: 458, type: !273)
!812 = !DILocation(line: 455, column: 50, scope: !804)
!813 = !DILocation(line: 456, column: 46, scope: !804)
!814 = !DILocation(line: 457, column: 39, scope: !804)
!815 = !DILocation(line: 458, column: 39, scope: !804)
!816 = !DILocation(line: 463, column: 52, scope: !804)
!817 = !DILocation(line: 463, column: 47, scope: !804)
!818 = !DILocation(line: 464, column: 49, scope: !804)
!819 = !DILocation(line: 467, column: 52, scope: !804)
!820 = !DILocation(line: 467, column: 47, scope: !804)
!821 = !DILocation(line: 468, column: 49, scope: !804)
!822 = !DILocation(line: 343, column: 61, scope: !762, inlinedAt: !823)
!823 = distinct !DILocation(line: 460, column: 10, scope: !804)
!824 = !DILocation(line: 344, column: 57, scope: !762, inlinedAt: !823)
!825 = !DILocation(line: 345, column: 50, scope: !762, inlinedAt: !823)
!826 = !DILocation(line: 346, column: 45, scope: !762, inlinedAt: !823)
!827 = !DILocation(line: 347, column: 50, scope: !762, inlinedAt: !823)
!828 = !DILocation(line: 348, column: 45, scope: !762, inlinedAt: !823)
!829 = !DILocation(line: 356, column: 9, scope: !762, inlinedAt: !823)
!830 = !DILocation(line: 350, column: 27, scope: !762, inlinedAt: !823)
!831 = !DILocation(line: 361, column: 8, scope: !762, inlinedAt: !823)
!832 = !DILocation(line: 361, column: 15, scope: !762, inlinedAt: !823)
!833 = !DILocation(line: 362, column: 8, scope: !762, inlinedAt: !823)
!834 = !DILocation(line: 362, column: 20, scope: !762, inlinedAt: !823)
!835 = !DILocation(line: 363, column: 8, scope: !762, inlinedAt: !823)
!836 = !DILocation(line: 363, column: 14, scope: !762, inlinedAt: !823)
!837 = !DILocation(line: 364, column: 8, scope: !762, inlinedAt: !823)
!838 = !DILocation(line: 364, column: 19, scope: !762, inlinedAt: !823)
!839 = !DILocation(line: 365, column: 8, scope: !762, inlinedAt: !823)
!840 = !DILocation(line: 365, column: 13, scope: !762, inlinedAt: !823)
!841 = !DILocation(line: 366, column: 8, scope: !762, inlinedAt: !823)
!842 = !DILocation(line: 366, column: 13, scope: !762, inlinedAt: !823)
!843 = !DILocation(line: 368, column: 27, scope: !792, inlinedAt: !823)
!844 = !DILocation(line: 368, column: 12, scope: !792, inlinedAt: !823)
!845 = !DILocation(line: 370, column: 17, scope: !796, inlinedAt: !823)
!846 = !DILocation(line: 375, column: 40, scope: !798, inlinedAt: !823)
!847 = !DILocation(line: 368, column: 7, scope: !762, inlinedAt: !823)
!848 = !DILocation(line: 0, scope: !804)
!849 = !DILocation(line: 0, scope: !796, inlinedAt: !823)
!850 = !DILocation(line: 460, column: 3, scope: !804)
!851 = distinct !DISubprogram(name: "MHD_lookup_connection_value", scope: !3, file: !3, line: 484, type: !852, isLocal: false, isDefinition: true, scopeLine: 487, flags: DIFlagPrototyped, isOptimized: true, unit: !11, retainedNodes: !854)
!852 = !DISubroutineType(types: !853)
!853 = !{!273, !235, !79, !273}
!854 = !{!855, !856, !857, !858}
!855 = !DILocalVariable(name: "connection", arg: 1, scope: !851, file: !3, line: 484, type: !235)
!856 = !DILocalVariable(name: "kind", arg: 2, scope: !851, file: !3, line: 485, type: !79)
!857 = !DILocalVariable(name: "key", arg: 3, scope: !851, file: !3, line: 486, type: !273)
!858 = !DILocalVariable(name: "value", scope: !851, file: !3, line: 488, type: !273)
!859 = !DILocation(line: 484, column: 53, scope: !851)
!860 = !DILocation(line: 485, column: 49, scope: !851)
!861 = !DILocation(line: 486, column: 42, scope: !851)
!862 = !DILocation(line: 488, column: 15, scope: !851)
!863 = !DILocation(line: 494, column: 47, scope: !851)
!864 = !DILocation(line: 494, column: 41, scope: !851)
!865 = !DILocation(line: 494, column: 61, scope: !851)
!866 = !DILocalVariable(name: "connection", arg: 1, scope: !867, file: !3, line: 521, type: !235)
!867 = distinct !DISubprogram(name: "MHD_lookup_connection_value_n", scope: !3, file: !3, line: 521, type: !868, isLocal: false, isDefinition: true, scopeLine: 527, flags: DIFlagPrototyped, isOptimized: true, unit: !11, retainedNodes: !871)
!868 = !DISubroutineType(types: !869)
!869 = !{!13, !235, !79, !273, !8, !870, !411}
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!871 = !{!866, !872, !873, !874, !875, !876, !877}
!872 = !DILocalVariable(name: "kind", arg: 2, scope: !867, file: !3, line: 522, type: !79)
!873 = !DILocalVariable(name: "key", arg: 3, scope: !867, file: !3, line: 523, type: !273)
!874 = !DILocalVariable(name: "key_size", arg: 4, scope: !867, file: !3, line: 524, type: !8)
!875 = !DILocalVariable(name: "value_ptr", arg: 5, scope: !867, file: !3, line: 525, type: !870)
!876 = !DILocalVariable(name: "value_size_ptr", arg: 6, scope: !867, file: !3, line: 526, type: !411)
!877 = !DILocalVariable(name: "pos", scope: !867, file: !3, line: 528, type: !187)
!878 = !DILocation(line: 521, column: 55, scope: !867, inlinedAt: !879)
!879 = distinct !DILocation(line: 491, column: 10, scope: !851)
!880 = !DILocation(line: 522, column: 51, scope: !867, inlinedAt: !879)
!881 = !DILocation(line: 523, column: 44, scope: !867, inlinedAt: !879)
!882 = !DILocation(line: 524, column: 39, scope: !867, inlinedAt: !879)
!883 = !DILocation(line: 525, column: 45, scope: !867, inlinedAt: !879)
!884 = !DILocation(line: 526, column: 40, scope: !867, inlinedAt: !879)
!885 = !DILocation(line: 530, column: 12, scope: !886, inlinedAt: !879)
!886 = distinct !DILexicalBlock(scope: !867, file: !3, line: 530, column: 7)
!887 = !DILocation(line: 530, column: 7, scope: !867, inlinedAt: !879)
!888 = !DILocation(line: 0, scope: !889, inlinedAt: !879)
!889 = distinct !DILexicalBlock(scope: !890, file: !3, line: 544, column: 5)
!890 = distinct !DILexicalBlock(scope: !891, file: !3, line: 543, column: 3)
!891 = distinct !DILexicalBlock(scope: !867, file: !3, line: 533, column: 7)
!892 = !DILocation(line: 528, column: 27, scope: !867, inlinedAt: !879)
!893 = !DILocation(line: 0, scope: !894, inlinedAt: !879)
!894 = distinct !DILexicalBlock(scope: !889, file: !3, line: 544, column: 5)
!895 = !DILocation(line: 533, column: 7, scope: !867, inlinedAt: !879)
!896 = !DILocation(line: 544, column: 5, scope: !889, inlinedAt: !879)
!897 = !DILocation(line: 535, column: 5, scope: !898, inlinedAt: !879)
!898 = distinct !DILexicalBlock(scope: !899, file: !3, line: 535, column: 5)
!899 = distinct !DILexicalBlock(scope: !891, file: !3, line: 534, column: 3)
!900 = !DILocation(line: 537, column: 31, scope: !901, inlinedAt: !879)
!901 = distinct !DILexicalBlock(scope: !902, file: !3, line: 537, column: 12)
!902 = distinct !DILexicalBlock(scope: !903, file: !3, line: 536, column: 5)
!903 = distinct !DILexicalBlock(scope: !898, file: !3, line: 535, column: 5)
!904 = !DILocation(line: 537, column: 24, scope: !901, inlinedAt: !879)
!905 = !DILocation(line: 537, column: 15, scope: !901, inlinedAt: !879)
!906 = !DILocation(line: 537, column: 38, scope: !901, inlinedAt: !879)
!907 = !DILocation(line: 538, column: 26, scope: !901, inlinedAt: !879)
!908 = !DILocation(line: 538, column: 18, scope: !901, inlinedAt: !879)
!909 = !DILocation(line: 537, column: 12, scope: !902, inlinedAt: !879)
!910 = !DILocation(line: 535, column: 70, scope: !903, inlinedAt: !879)
!911 = !DILocation(line: 535, column: 51, scope: !903, inlinedAt: !879)
!912 = distinct !{!912, !913, !914}
!913 = !DILocation(line: 535, column: 5, scope: !898)
!914 = !DILocation(line: 540, column: 5, scope: !898)
!915 = !DILocation(line: 546, column: 31, scope: !916, inlinedAt: !879)
!916 = distinct !DILexicalBlock(scope: !917, file: !3, line: 546, column: 12)
!917 = distinct !DILexicalBlock(scope: !894, file: !3, line: 545, column: 5)
!918 = !DILocation(line: 546, column: 24, scope: !916, inlinedAt: !879)
!919 = !DILocation(line: 546, column: 15, scope: !916, inlinedAt: !879)
!920 = !DILocation(line: 546, column: 38, scope: !916, inlinedAt: !879)
!921 = !DILocation(line: 547, column: 30, scope: !916, inlinedAt: !879)
!922 = !DILocation(line: 547, column: 22, scope: !916, inlinedAt: !879)
!923 = !DILocation(line: 547, column: 43, scope: !916, inlinedAt: !879)
!924 = !DILocation(line: 548, column: 27, scope: !916, inlinedAt: !879)
!925 = !DILocation(line: 548, column: 19, scope: !916, inlinedAt: !879)
!926 = !DILocation(line: 548, column: 35, scope: !916, inlinedAt: !879)
!927 = !DILocation(line: 549, column: 15, scope: !916, inlinedAt: !879)
!928 = !DILocation(line: 546, column: 12, scope: !917, inlinedAt: !879)
!929 = !DILocation(line: 544, column: 70, scope: !894, inlinedAt: !879)
!930 = !DILocation(line: 544, column: 51, scope: !894, inlinedAt: !879)
!931 = distinct !{!931, !932, !933}
!932 = !DILocation(line: 544, column: 5, scope: !889)
!933 = !DILocation(line: 553, column: 5, scope: !889)
!934 = !DILocation(line: 560, column: 23, scope: !935, inlinedAt: !879)
!935 = distinct !DILexicalBlock(scope: !867, file: !3, line: 559, column: 7)
!936 = !DILocation(line: 497, column: 3, scope: !851)
!937 = !DILocation(line: 521, column: 55, scope: !867)
!938 = !DILocation(line: 522, column: 51, scope: !867)
!939 = !DILocation(line: 523, column: 44, scope: !867)
!940 = !DILocation(line: 524, column: 39, scope: !867)
!941 = !DILocation(line: 525, column: 45, scope: !867)
!942 = !DILocation(line: 526, column: 40, scope: !867)
!943 = !DILocation(line: 530, column: 12, scope: !886)
!944 = !DILocation(line: 530, column: 7, scope: !867)
!945 = !DILocation(line: 533, column: 12, scope: !891)
!946 = !DILocation(line: 0, scope: !889)
!947 = !DILocation(line: 528, column: 27, scope: !867)
!948 = !DILocation(line: 0, scope: !894)
!949 = !DILocation(line: 533, column: 7, scope: !867)
!950 = !DILocation(line: 537, column: 31, scope: !901)
!951 = !DILocation(line: 537, column: 24, scope: !901)
!952 = !DILocation(line: 537, column: 15, scope: !901)
!953 = !DILocation(line: 537, column: 38, scope: !901)
!954 = !DILocation(line: 538, column: 26, scope: !901)
!955 = !DILocation(line: 538, column: 18, scope: !901)
!956 = !DILocation(line: 537, column: 12, scope: !902)
!957 = !DILocation(line: 535, column: 70, scope: !903)
!958 = !DILocation(line: 535, column: 51, scope: !903)
!959 = !DILocation(line: 546, column: 31, scope: !916)
!960 = !DILocation(line: 546, column: 24, scope: !916)
!961 = !DILocation(line: 546, column: 15, scope: !916)
!962 = !DILocation(line: 546, column: 38, scope: !916)
!963 = !DILocation(line: 547, column: 30, scope: !916)
!964 = !DILocation(line: 547, column: 22, scope: !916)
!965 = !DILocation(line: 547, column: 43, scope: !916)
!966 = !DILocation(line: 548, column: 27, scope: !916)
!967 = !DILocation(line: 548, column: 19, scope: !916)
!968 = !DILocation(line: 548, column: 35, scope: !916)
!969 = !DILocation(line: 549, column: 15, scope: !916)
!970 = !DILocation(line: 546, column: 12, scope: !917)
!971 = !DILocation(line: 544, column: 70, scope: !894)
!972 = !DILocation(line: 544, column: 51, scope: !894)
!973 = !DILocation(line: 559, column: 12, scope: !935)
!974 = !DILocation(line: 559, column: 7, scope: !867)
!975 = !DILocation(line: 560, column: 23, scope: !935)
!976 = !DILocation(line: 560, column: 16, scope: !935)
!977 = !DILocation(line: 560, column: 5, scope: !935)
!978 = !DILocation(line: 562, column: 12, scope: !979)
!979 = distinct !DILexicalBlock(scope: !867, file: !3, line: 562, column: 7)
!980 = !DILocation(line: 562, column: 7, scope: !867)
!981 = !DILocation(line: 563, column: 28, scope: !979)
!982 = !DILocation(line: 563, column: 21, scope: !979)
!983 = !{!628, !628, i64 0}
!984 = !DILocation(line: 563, column: 5, scope: !979)
!985 = !DILocation(line: 0, scope: !867)
!986 = !DILocation(line: 566, column: 1, scope: !867)
!987 = distinct !DISubprogram(name: "MHD_connection_mark_closed_", scope: !3, file: !3, line: 666, type: !988, isLocal: false, isDefinition: true, scopeLine: 667, flags: DIFlagPrototyped, isOptimized: true, unit: !11, retainedNodes: !990)
!988 = !DISubroutineType(types: !989)
!989 = !{null, !235}
!990 = !{!991, !992}
!991 = !DILocalVariable(name: "connection", arg: 1, scope: !987, file: !3, line: 666, type: !235)
!992 = !DILocalVariable(name: "daemon", scope: !987, file: !3, line: 668, type: !993)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !228)
!995 = !DILocation(line: 666, column: 53, scope: !987)
!996 = !DILocation(line: 668, column: 49, scope: !987)
!997 = !{!675, !619, i64 48}
!998 = !DILocation(line: 668, column: 28, scope: !987)
!999 = !DILocation(line: 670, column: 15, scope: !987)
!1000 = !DILocation(line: 670, column: 21, scope: !987)
!1001 = !{!675, !620, i64 356}
!1002 = !DILocation(line: 671, column: 15, scope: !987)
!1003 = !DILocation(line: 671, column: 31, scope: !987)
!1004 = !{!675, !620, i64 360}
!1005 = !DILocation(line: 672, column: 21, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !987, file: !3, line: 672, column: 7)
!1007 = !{!1008, !620, i64 16}
!1008 = !{!"MHD_Daemon", !619, i64 0, !619, i64 8, !620, i64 16, !619, i64 24, !619, i64 32, !619, i64 40, !619, i64 48, !619, i64 56, !619, i64 64, !619, i64 72, !619, i64 80, !620, i64 88, !619, i64 96, !619, i64 104, !678, i64 112, !679, i64 116, !619, i64 120, !619, i64 128, !619, i64 136, !619, i64 144, !619, i64 152, !619, i64 160, !619, i64 168, !619, i64 176, !619, i64 184, !619, i64 192, !619, i64 200, !619, i64 208, !619, i64 216, !619, i64 224, !619, i64 232, !619, i64 240, !1009, i64 248, !619, i64 256, !619, i64 264, !619, i64 272, !678, i64 280, !619, i64 288, !619, i64 296, !678, i64 304, !628, i64 312, !628, i64 320, !628, i64 328, !678, i64 336, !676, i64 344, !620, i64 360, !620, i64 400, !620, i64 440, !620, i64 480, !678, i64 484, !1010, i64 488, !679, i64 492, !679, i64 493, !679, i64 494, !679, i64 495, !679, i64 496, !679, i64 497, !678, i64 500, !628, i64 504, !678, i64 512, !678, i64 516, !679, i64 520, !619, i64 528, !619, i64 536, !620, i64 544, !628, i64 584, !678, i64 592, !678, i64 596, !678, i64 600, !628, i64 608}
!1009 = !{!"short", !620, i64 0}
!1010 = !{!"MHD_itc_", !678, i64 0}
!1011 = !DILocation(line: 672, column: 29, scope: !1006)
!1012 = !DILocation(line: 672, column: 9, scope: !1006)
!1013 = !DILocation(line: 672, column: 7, scope: !987)
!1014 = !DILocation(line: 688, column: 27, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 673, column: 3)
!1016 = !{!675, !678, i64 328}
!1017 = !DILocation(line: 688, column: 5, scope: !1015)
!1018 = !DILocation(line: 690, column: 3, scope: !1015)
!1019 = !DILocation(line: 691, column: 1, scope: !987)
!1020 = distinct !DISubprogram(name: "MHD_connection_close_", scope: !3, file: !3, line: 704, type: !1021, isLocal: false, isDefinition: true, scopeLine: 706, flags: DIFlagPrototyped, isOptimized: true, unit: !11, retainedNodes: !1023)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{null, !235, !64}
!1023 = !{!1024, !1025, !1026, !1027}
!1024 = !DILocalVariable(name: "connection", arg: 1, scope: !1020, file: !3, line: 704, type: !235)
!1025 = !DILocalVariable(name: "termination_code", arg: 2, scope: !1020, file: !3, line: 705, type: !64)
!1026 = !DILocalVariable(name: "daemon", scope: !1020, file: !3, line: 707, type: !227)
!1027 = !DILocalVariable(name: "resp", scope: !1020, file: !3, line: 708, type: !248)
!1028 = !DILocation(line: 704, column: 47, scope: !1020)
!1029 = !DILocation(line: 705, column: 56, scope: !1020)
!1030 = !DILocation(line: 707, column: 43, scope: !1020)
!1031 = !DILocation(line: 707, column: 22, scope: !1020)
!1032 = !DILocation(line: 708, column: 43, scope: !1020)
!1033 = !{!675, !619, i64 72}
!1034 = !DILocation(line: 708, column: 24, scope: !1020)
!1035 = !DILocation(line: 666, column: 53, scope: !987, inlinedAt: !1036)
!1036 = distinct !DILocation(line: 715, column: 3, scope: !1020)
!1037 = !DILocation(line: 668, column: 28, scope: !987, inlinedAt: !1036)
!1038 = !DILocation(line: 670, column: 15, scope: !987, inlinedAt: !1036)
!1039 = !DILocation(line: 670, column: 21, scope: !987, inlinedAt: !1036)
!1040 = !DILocation(line: 671, column: 15, scope: !987, inlinedAt: !1036)
!1041 = !DILocation(line: 671, column: 31, scope: !987, inlinedAt: !1036)
!1042 = !DILocation(line: 672, column: 21, scope: !1006, inlinedAt: !1036)
!1043 = !DILocation(line: 672, column: 29, scope: !1006, inlinedAt: !1036)
!1044 = !DILocation(line: 672, column: 9, scope: !1006, inlinedAt: !1036)
!1045 = !DILocation(line: 672, column: 7, scope: !987, inlinedAt: !1036)
!1046 = !DILocation(line: 688, column: 27, scope: !1015, inlinedAt: !1036)
!1047 = !DILocation(line: 688, column: 5, scope: !1015, inlinedAt: !1036)
!1048 = !DILocation(line: 690, column: 3, scope: !1015, inlinedAt: !1036)
!1049 = !DILocation(line: 716, column: 12, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1020, file: !3, line: 716, column: 7)
!1051 = !DILocation(line: 716, column: 7, scope: !1020)
!1052 = !DILocation(line: 718, column: 26, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1050, file: !3, line: 717, column: 3)
!1054 = !DILocation(line: 719, column: 5, scope: !1053)
!1055 = !DILocation(line: 720, column: 3, scope: !1053)
!1056 = !DILocation(line: 721, column: 25, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !1020, file: !3, line: 721, column: 8)
!1058 = !{!1008, !619, i64 184}
!1059 = !DILocation(line: 721, column: 14, scope: !1057)
!1060 = !DILocation(line: 0, scope: !1057)
!1061 = !DILocation(line: 721, column: 43, scope: !1057)
!1062 = !DILocation(line: 722, column: 21, scope: !1057)
!1063 = !{!675, !679, i64 324}
!1064 = !{i8 0, i8 2}
!1065 = !DILocation(line: 721, column: 8, scope: !1020)
!1066 = !DILocation(line: 723, column: 39, scope: !1057)
!1067 = !{!1008, !619, i64 192}
!1068 = !DILocation(line: 725, column: 44, scope: !1057)
!1069 = !DILocation(line: 723, column: 5, scope: !1057)
!1070 = !DILocation(line: 727, column: 28, scope: !1020)
!1071 = !DILocation(line: 728, column: 1, scope: !1020)
!1072 = distinct !DISubprogram(name: "MHD_update_last_activity_", scope: !3, file: !3, line: 2788, type: !988, isLocal: false, isDefinition: true, scopeLine: 2789, flags: DIFlagPrototyped, isOptimized: true, unit: !11, retainedNodes: !1073)
!1073 = !{!1074, !1075}
!1074 = !DILocalVariable(name: "connection", arg: 1, scope: !1072, file: !3, line: 2788, type: !235)
!1075 = !DILocalVariable(name: "daemon", scope: !1072, file: !3, line: 2790, type: !227)
!1076 = !DILocation(line: 2788, column: 51, scope: !1072)
!1077 = !DILocation(line: 2790, column: 43, scope: !1072)
!1078 = !DILocation(line: 2790, column: 22, scope: !1072)
!1079 = !DILocation(line: 2792, column: 24, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1072, file: !3, line: 2792, column: 7)
!1081 = !{!675, !628, i64 312}
!1082 = !DILocation(line: 2792, column: 9, scope: !1080)
!1083 = !DILocation(line: 2792, column: 7, scope: !1072)
!1084 = !DILocation(line: 2795, column: 19, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1072, file: !3, line: 2795, column: 7)
!1086 = !{!675, !679, i64 408}
!1087 = !DILocation(line: 2795, column: 7, scope: !1072)
!1088 = !DILocation(line: 2798, column: 31, scope: !1072)
!1089 = !DILocation(line: 2798, column: 15, scope: !1072)
!1090 = !DILocation(line: 2798, column: 29, scope: !1072)
!1091 = !{!675, !628, i64 304}
!1092 = !DILocation(line: 2799, column: 21, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1072, file: !3, line: 2799, column: 7)
!1094 = !DILocation(line: 2799, column: 29, scope: !1093)
!1095 = !DILocation(line: 2799, column: 9, scope: !1093)
!1096 = !DILocation(line: 2799, column: 7, scope: !1072)
!1097 = !DILocation(line: 2802, column: 19, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1072, file: !3, line: 2802, column: 7)
!1099 = !DILocation(line: 2802, column: 49, scope: !1098)
!1100 = !{!1008, !628, i64 504}
!1101 = !DILocation(line: 2802, column: 38, scope: !1098)
!1102 = !DILocation(line: 2802, column: 7, scope: !1072)
!1103 = !DILocation(line: 2805, column: 3, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1105, file: !3, line: 2805, column: 3)
!1105 = distinct !DILexicalBlock(scope: !1072, file: !3, line: 2805, column: 3)
!1106 = !DILocation(line: 2805, column: 3, scope: !1105)
!1107 = !DILocation(line: 2805, column: 3, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1104, file: !3, line: 2805, column: 3)
!1109 = !DILocation(line: 2808, column: 3, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1111, file: !3, line: 2808, column: 3)
!1111 = distinct !DILexicalBlock(scope: !1072, file: !3, line: 2808, column: 3)
!1112 = !{!675, !619, i64 40}
!1113 = !DILocation(line: 2808, column: 3, scope: !1114)
!1114 = distinct !DILexicalBlock(scope: !1110, file: !3, line: 2808, column: 3)
!1115 = !{!675, !619, i64 32}
!1116 = !DILocation(line: 2808, column: 3, scope: !1111)
!1117 = !{!1008, !619, i64 136}
!1118 = !DILocation(line: 2808, column: 3, scope: !1119)
!1119 = distinct !DILexicalBlock(scope: !1110, file: !3, line: 2808, column: 3)
!1120 = !DILocation(line: 2808, column: 3, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1111, file: !3, line: 2808, column: 3)
!1122 = !DILocation(line: 2808, column: 3, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !1121, file: !3, line: 2808, column: 3)
!1124 = !{!1008, !619, i64 144}
!1125 = !DILocation(line: 2808, column: 3, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1121, file: !3, line: 2808, column: 3)
!1127 = !DILocation(line: 2811, column: 3, scope: !1128)
!1128 = distinct !DILexicalBlock(scope: !1129, file: !3, line: 2811, column: 3)
!1129 = distinct !DILexicalBlock(scope: !1072, file: !3, line: 2811, column: 3)
!1130 = !DILocation(line: 2811, column: 3, scope: !1129)
!1131 = !DILocation(line: 2811, column: 3, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1128, file: !3, line: 2811, column: 3)
!1133 = !DILocation(line: 2815, column: 3, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1135, file: !3, line: 2815, column: 3)
!1135 = distinct !DILexicalBlock(scope: !1072, file: !3, line: 2815, column: 3)
!1136 = !DILocation(line: 2815, column: 3, scope: !1135)
!1137 = !DILocation(line: 2815, column: 3, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !1134, file: !3, line: 2815, column: 3)
!1139 = !DILocation(line: 2817, column: 1, scope: !1072)
!1140 = distinct !DISubprogram(name: "MHD_connection_handle_read", scope: !3, file: !3, line: 2827, type: !988, isLocal: false, isDefinition: true, scopeLine: 2828, flags: DIFlagPrototyped, isOptimized: true, unit: !11, retainedNodes: !1141)
!1141 = !{!1142, !1143}
!1142 = !DILocalVariable(name: "connection", arg: 1, scope: !1140, file: !3, line: 2827, type: !235)
!1143 = !DILocalVariable(name: "bytes_read", scope: !1140, file: !3, line: 2829, type: !259)
!1144 = !DILocation(line: 2827, column: 52, scope: !1140)
!1145 = !DILocation(line: 2831, column: 46, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1140, file: !3, line: 2831, column: 8)
!1147 = !DILocation(line: 2831, column: 31, scope: !1146)
!1148 = !DILocation(line: 2831, column: 53, scope: !1146)
!1149 = !DILocation(line: 2832, column: 21, scope: !1146)
!1150 = !DILocation(line: 2831, column: 8, scope: !1140)
!1151 = !DILocation(line: 2847, column: 19, scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !1140, file: !3, line: 2847, column: 7)
!1153 = !{!675, !628, i64 200}
!1154 = !DILocation(line: 2847, column: 52, scope: !1152)
!1155 = !DILocation(line: 2847, column: 60, scope: !1152)
!1156 = !{!1008, !628, i64 320}
!1157 = !DILocation(line: 2847, column: 38, scope: !1152)
!1158 = !DILocation(line: 2848, column: 19, scope: !1152)
!1159 = !{!675, !628, i64 192}
!1160 = !DILocation(line: 2847, column: 75, scope: !1152)
!1161 = !DILocation(line: 2847, column: 7, scope: !1140)
!1162 = !DILocation(line: 2850, column: 57, scope: !1152)
!1163 = !DILocation(line: 1193, column: 46, scope: !541, inlinedAt: !1164)
!1164 = distinct !DILocation(line: 2849, column: 5, scope: !1152)
!1165 = !DILocation(line: 1194, column: 28, scope: !541, inlinedAt: !1164)
!1166 = !DILocation(line: 1200, column: 47, scope: !541, inlinedAt: !1164)
!1167 = !DILocation(line: 1200, column: 16, scope: !541, inlinedAt: !1164)
!1168 = !DILocation(line: 1197, column: 10, scope: !541, inlinedAt: !1164)
!1169 = !DILocation(line: 1201, column: 9, scope: !1170, inlinedAt: !1164)
!1170 = distinct !DILexicalBlock(scope: !541, file: !3, line: 1201, column: 7)
!1171 = !DILocation(line: 1201, column: 7, scope: !541, inlinedAt: !1164)
!1172 = !DILocation(line: 1203, column: 24, scope: !552, inlinedAt: !1164)
!1173 = !DILocation(line: 1203, column: 9, scope: !552, inlinedAt: !1164)
!1174 = !DILocation(line: 1203, column: 7, scope: !541, inlinedAt: !1164)
!1175 = !DILocation(line: 1204, column: 27, scope: !552, inlinedAt: !1164)
!1176 = !DILocation(line: 1196, column: 10, scope: !541, inlinedAt: !1164)
!1177 = !DILocation(line: 1204, column: 5, scope: !552, inlinedAt: !1164)
!1178 = !DILocation(line: 1209, column: 28, scope: !551, inlinedAt: !1164)
!1179 = !DILocation(line: 1207, column: 12, scope: !551, inlinedAt: !1164)
!1180 = !DILocation(line: 1210, column: 26, scope: !1181, inlinedAt: !1164)
!1181 = distinct !DILexicalBlock(scope: !551, file: !3, line: 1210, column: 9)
!1182 = !DILocation(line: 1210, column: 9, scope: !551, inlinedAt: !1164)
!1183 = !DILocation(line: 1212, column: 11, scope: !1184, inlinedAt: !1164)
!1184 = distinct !DILexicalBlock(scope: !1181, file: !3, line: 1211, column: 5)
!1185 = !DILocation(line: 1219, column: 11, scope: !1186, inlinedAt: !1164)
!1186 = distinct !DILexicalBlock(scope: !1187, file: !3, line: 1218, column: 13)
!1187 = distinct !DILexicalBlock(scope: !1188, file: !3, line: 1215, column: 7)
!1188 = distinct !DILexicalBlock(scope: !1184, file: !3, line: 1212, column: 11)
!1189 = !DILocation(line: 0, scope: !551, inlinedAt: !1164)
!1190 = !DILocation(line: 1224, column: 45, scope: !551, inlinedAt: !1164)
!1191 = !DILocation(line: 1227, column: 41, scope: !541, inlinedAt: !1164)
!1192 = !DILocation(line: 1228, column: 41, scope: !541, inlinedAt: !1164)
!1193 = !{!675, !619, i64 136}
!1194 = !DILocation(line: 1227, column: 8, scope: !541, inlinedAt: !1164)
!1195 = !DILocation(line: 1198, column: 9, scope: !541, inlinedAt: !1164)
!1196 = !DILocation(line: 1231, column: 12, scope: !1197, inlinedAt: !1164)
!1197 = distinct !DILexicalBlock(scope: !541, file: !3, line: 1231, column: 7)
!1198 = !DILocation(line: 1231, column: 7, scope: !541, inlinedAt: !1164)
!1199 = !DILocation(line: 1242, column: 27, scope: !541, inlinedAt: !1164)
!1200 = !DILocation(line: 1244, column: 32, scope: !541, inlinedAt: !1164)
!1201 = !DILocation(line: 1245, column: 3, scope: !541, inlinedAt: !1164)
!1202 = !DILocation(line: 2853, column: 19, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1140, file: !3, line: 2853, column: 7)
!1204 = !DILocation(line: 2853, column: 51, scope: !1203)
!1205 = !DILocation(line: 2853, column: 36, scope: !1203)
!1206 = !DILocation(line: 2853, column: 7, scope: !1140)
!1207 = !DILocation(line: 2855, column: 28, scope: !1140)
!1208 = !{!675, !619, i64 392}
!1209 = !DILocation(line: 2856, column: 51, scope: !1140)
!1210 = !DILocation(line: 2856, column: 39, scope: !1140)
!1211 = !DILocation(line: 2859, column: 38, scope: !1140)
!1212 = !DILocation(line: 2855, column: 16, scope: !1140)
!1213 = !DILocation(line: 2829, column: 11, scope: !1140)
!1214 = !DILocation(line: 2860, column: 18, scope: !1215)
!1215 = distinct !DILexicalBlock(scope: !1140, file: !3, line: 2860, column: 7)
!1216 = !DILocation(line: 2860, column: 7, scope: !1140)
!1217 = !DILocation(line: 2862, column: 9, scope: !1218)
!1218 = distinct !DILexicalBlock(scope: !1215, file: !3, line: 2861, column: 3)
!1219 = !DILocation(line: 2866, column: 7, scope: !1220)
!1220 = distinct !DILexicalBlock(scope: !1221, file: !3, line: 2865, column: 5)
!1221 = distinct !DILexicalBlock(scope: !1218, file: !3, line: 2864, column: 9)
!1222 = !DILocalVariable(name: "connection", arg: 1, scope: !1223, file: !3, line: 813, type: !235)
!1223 = distinct !DISubprogram(name: "connection_close_error", scope: !3, file: !3, line: 813, type: !1224, isLocal: true, isDefinition: true, scopeLine: 815, flags: DIFlagPrototyped, isOptimized: true, unit: !11, retainedNodes: !1226)
!1224 = !DISubroutineType(types: !1225)
!1225 = !{null, !235, !273}
!1226 = !{!1222, !1227}
!1227 = !DILocalVariable(name: "emsg", arg: 2, scope: !1223, file: !3, line: 814, type: !273)
!1228 = !DILocation(line: 813, column: 48, scope: !1223, inlinedAt: !1229)
!1229 = distinct !DILocation(line: 2866, column: 7, scope: !1220)
!1230 = !DILocation(line: 817, column: 7, scope: !1223, inlinedAt: !1229)
!1231 = !DILocation(line: 814, column: 37, scope: !1223, inlinedAt: !1229)
!1232 = !DILocation(line: 818, column: 27, scope: !1233, inlinedAt: !1229)
!1233 = distinct !DILexicalBlock(scope: !1223, file: !3, line: 817, column: 7)
!1234 = !DILocation(line: 818, column: 5, scope: !1233, inlinedAt: !1229)
!1235 = !DILocation(line: 704, column: 47, scope: !1020, inlinedAt: !1236)
!1236 = distinct !DILocation(line: 824, column: 3, scope: !1223, inlinedAt: !1229)
!1237 = !DILocation(line: 705, column: 56, scope: !1020, inlinedAt: !1236)
!1238 = !DILocation(line: 707, column: 43, scope: !1020, inlinedAt: !1236)
!1239 = !DILocation(line: 707, column: 22, scope: !1020, inlinedAt: !1236)
!1240 = !DILocation(line: 708, column: 43, scope: !1020, inlinedAt: !1236)
!1241 = !DILocation(line: 708, column: 24, scope: !1020, inlinedAt: !1236)
!1242 = !DILocation(line: 666, column: 53, scope: !987, inlinedAt: !1243)
!1243 = distinct !DILocation(line: 715, column: 3, scope: !1020, inlinedAt: !1236)
!1244 = !DILocation(line: 668, column: 28, scope: !987, inlinedAt: !1243)
!1245 = !DILocation(line: 670, column: 21, scope: !987, inlinedAt: !1243)
!1246 = !DILocation(line: 671, column: 15, scope: !987, inlinedAt: !1243)
!1247 = !DILocation(line: 671, column: 31, scope: !987, inlinedAt: !1243)
!1248 = !DILocation(line: 672, column: 21, scope: !1006, inlinedAt: !1243)
!1249 = !DILocation(line: 672, column: 29, scope: !1006, inlinedAt: !1243)
!1250 = !DILocation(line: 672, column: 9, scope: !1006, inlinedAt: !1243)
!1251 = !DILocation(line: 672, column: 7, scope: !987, inlinedAt: !1243)
!1252 = !DILocation(line: 688, column: 27, scope: !1015, inlinedAt: !1243)
!1253 = !DILocation(line: 688, column: 5, scope: !1015, inlinedAt: !1243)
!1254 = !DILocation(line: 690, column: 3, scope: !1015, inlinedAt: !1243)
!1255 = !DILocation(line: 716, column: 12, scope: !1050, inlinedAt: !1236)
!1256 = !DILocation(line: 716, column: 7, scope: !1020, inlinedAt: !1236)
!1257 = !DILocation(line: 718, column: 26, scope: !1053, inlinedAt: !1236)
!1258 = !DILocation(line: 719, column: 5, scope: !1053, inlinedAt: !1236)
!1259 = !DILocation(line: 720, column: 3, scope: !1053, inlinedAt: !1236)
!1260 = !DILocation(line: 721, column: 25, scope: !1057, inlinedAt: !1236)
!1261 = !DILocation(line: 721, column: 14, scope: !1057, inlinedAt: !1236)
!1262 = !DILocation(line: 0, scope: !1057, inlinedAt: !1236)
!1263 = !DILocation(line: 721, column: 43, scope: !1057, inlinedAt: !1236)
!1264 = !DILocation(line: 722, column: 21, scope: !1057, inlinedAt: !1236)
!1265 = !DILocation(line: 721, column: 8, scope: !1020, inlinedAt: !1236)
!1266 = !DILocation(line: 723, column: 39, scope: !1057, inlinedAt: !1236)
!1267 = !DILocation(line: 725, column: 44, scope: !1057, inlinedAt: !1236)
!1268 = !DILocation(line: 723, column: 5, scope: !1057, inlinedAt: !1236)
!1269 = !DILocation(line: 727, column: 28, scope: !1020, inlinedAt: !1236)
!1270 = !DILocation(line: 2871, column: 7, scope: !1220)
!1271 = !DILocation(line: 2875, column: 44, scope: !1272)
!1272 = distinct !DILexicalBlock(scope: !1218, file: !3, line: 2875, column: 9)
!1273 = !DILocation(line: 2875, column: 29, scope: !1272)
!1274 = !DILocation(line: 2875, column: 9, scope: !1218)
!1275 = !DILocation(line: 2876, column: 29, scope: !1272)
!1276 = !DILocalVariable(name: "mhd_err_code", arg: 1, scope: !1277, file: !3, line: 135, type: !259)
!1277 = distinct !DISubprogram(name: "str_conn_error_", scope: !3, file: !3, line: 135, type: !1278, isLocal: true, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: true, unit: !11, retainedNodes: !1280)
!1278 = !DISubroutineType(types: !1279)
!1279 = !{!273, !259}
!1280 = !{!1276}
