; ModuleID = 'src/microhttpd/response.c'
source_filename = "src/microhttpd/response.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.MHD_Response = type { %struct.MHD_HTTP_Header*, i8*, i8*, i64 (i8*, i64, i8*, i64)*, void (i8*)*, void (i8*, %struct.MHD_Connection*, i8*, i8*, i64, i32, %struct.MHD_UpgradeResponseHandle*)*, i8*, %union.pthread_mutex_t, i64, i64, i64, i64, i64, i32, i32, i32, i8, %struct.iovec*, i32 }
%struct.MHD_HTTP_Header = type { %struct.MHD_HTTP_Header*, i8*, i64, i8*, i64, i32 }
%struct.MHD_Connection = type { %struct.MHD_Connection*, %struct.MHD_Connection*, %struct.MHD_Connection*, %struct.MHD_Connection*, %struct.MHD_Connection*, %struct.MHD_Connection*, %struct.MHD_Daemon*, %struct.MHD_HTTP_Header*, %struct.MHD_HTTP_Header*, %struct.MHD_Response*, %struct.MemoryPool*, i8*, i8*, i8*, i8*, i8*, i32, i8*, i8*, i8*, i8*, %struct.sockaddr*, %struct._MHD_thread_handle_ID_, i64, i64, i64, i64, i64, i64, i64, i64, %struct.MHD_iovec_track_, i32, i64, i32, i64, i64, i32, i8, i32, i32, i8, i8, i32, i32, i8, i8, i8, i8, i32, i32, i32, i32, i8, i64, i64, i64 (%struct.MHD_Connection*, i8*, i64)*, %struct.MHD_UpgradeResponseHandle*, i8, i32, i8 }

!113 = !DIEnumerator(name: "MHD_CONNECTION_BODY_SENT", value: 16, isUnsigned: true)
!114 = !DIEnumerator(name: "MHD_CONNECTION_FOOTERS_SENDING", value: 17, isUnsigned: true)
!115 = !DIEnumerator(name: "MHD_CONNECTION_FOOTERS_SENT", value: 18, isUnsigned: true)
!116 = !DIEnumerator(name: "MHD_CONNECTION_CLOSED", value: 19, isUnsigned: true)
!117 = !DIEnumerator(name: "MHD_CONNECTION_UPGRADE", value: 20, isUnsigned: true)
!118 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MHD_ConnectionEventLoopInfo", file: !54, line: 232, baseType: !5, size: 32, elements: !119)
!119 = !{!120, !121, !122, !123}
!120 = !DIEnumerator(name: "MHD_EVENT_LOOP_INFO_READ", value: 0, isUnsigned: true)
!121 = !DIEnumerator(name: "MHD_EVENT_LOOP_INFO_WRITE", value: 1, isUnsigned: true)
!122 = !DIEnumerator(name: "MHD_EVENT_LOOP_INFO_BLOCK", value: 2, isUnsigned: true)
!123 = !DIEnumerator(name: "MHD_EVENT_LOOP_INFO_CLEANUP", value: 3, isUnsigned: true)
!124 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MHD_ResponseFlags", file: !4, line: 3023, baseType: !5, size: 32, elements: !125)
!125 = !{!126, !127, !128, !129}
!126 = !DIEnumerator(name: "MHD_RF_NONE", value: 0, isUnsigned: true)
!127 = !DIEnumerator(name: "MHD_RF_HTTP_VERSION_1_0_ONLY", value: 1, isUnsigned: true)
!128 = !DIEnumerator(name: "MHD_RF_HTTP_VERSION_1_0_RESPONSE", value: 2, isUnsigned: true)
!129 = !DIEnumerator(name: "MHD_RF_INSANITY_HEADER_CONTENT_LENGTH", value: 4, isUnsigned: true)
!130 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MHD_ResponseOptions", file: !4, line: 3061, baseType: !5, size: 32, elements: !131)
!131 = !{!132}
!132 = !DIEnumerator(name: "MHD_RO_END", value: 0, isUnsigned: true)
!133 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MHD_ResponseMemoryMode", file: !4, line: 3135, baseType: !5, size: 32, elements: !134)
!134 = !{!135, !136, !137}
!135 = !DIEnumerator(name: "MHD_RESPMEM_PERSISTENT", value: 0, isUnsigned: true)
!136 = !DIEnumerator(name: "MHD_RESPMEM_MUST_FREE", value: 1, isUnsigned: true)
!137 = !DIEnumerator(name: "MHD_RESPMEM_MUST_COPY", value: 2, isUnsigned: true)
!138 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MHD_UpgradeAction", file: !4, line: 3332, baseType: !5, size: 32, elements: !139)
!139 = !{!140, !141, !142}
!140 = !DIEnumerator(name: "MHD_UPGRADE_ACTION_CLOSE", value: 0, isUnsigned: true)
!141 = !DIEnumerator(name: "MHD_UPGRADE_ACTION_CORK_ON", value: 1, isUnsigned: true)
!142 = !DIEnumerator(name: "MHD_UPGRADE_ACTION_CORK_OFF", value: 2, isUnsigned: true)
!143 = !{!144, !145, !150, !153, !159, !160}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !146, line: 27, baseType: !147)
!146 = !DIFile(filename: "/nix/store/q141hd8jl7in5223jmf7kmx9h517km4p-glibc-2.32-54-dev/include/bits/stdint-intn.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !148, line: 44, baseType: !149)
!148 = !DIFile(filename: "/nix/store/q141hd8jl7in5223jmf7kmx9h517km4p-glibc-2.32-54-dev/include/bits/types.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!149 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !151, line: 62, baseType: !152)
!151 = !DIFile(filename: "/nix/store/9kpya70w4q7js35f34c572f1yyq0c2bh-clang-wrapper-7.1.0/resource-root/include/stddef.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!152 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !156, line: 24, baseType: !157)
!156 = !DIFile(filename: "/nix/store/q141hd8jl7in5223jmf7kmx9h517km4p-glibc-2.32-54-dev/include/bits/stdint-uintn.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !148, line: 38, baseType: !158)
!158 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_iov_size_", file: !54, line: 368, baseType: !150)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_SCKT_SEND_SIZE_", file: !161, line: 296, baseType: !150)
!161 = !DIFile(filename: "src/microhttpd/mhd_sockets.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!162 = !{i32 2, !"Dwarf Version", i32 4}
!163 = !{i32 2, !"Debug Info Version", i32 3}
!164 = !{i32 1, !"wchar_size", i32 4}
!165 = !{i32 7, !"PIC Level", i32 2}
!166 = !{!"clang version 7.1.0 (tags/RELEASE_710/final)"}
!167 = distinct !DISubprogram(name: "MHD_add_response_header", scope: !1, file: !1, line: 134, type: !168, isLocal: false, isDefinition: true, scopeLine: 137, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !498)
!168 = !DISubroutineType(types: !169)
!169 = !{!3, !170, !225, !225}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MHD_Response", file: !54, line: 406, size: 1344, elements: !172)
!172 = !{!173, !185, !186, !187, !197, !202, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "first_header", scope: !171, file: !54, line: 414, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MHD_HTTP_Header", file: !54, line: 313, size: 384, elements: !176)
!176 = !{!177, !178, !181, !182, !183, !184}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !175, file: !54, line: 318, baseType: !174, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !175, file: !54, line: 323, baseType: !179, size: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "header_size", scope: !175, file: !54, line: 328, baseType: !150, size: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !175, file: !54, line: 333, baseType: !179, size: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !175, file: !54, line: 338, baseType: !150, size: 64, offset: 256)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !175, file: !54, line: 344, baseType: !9, size: 32, offset: 320)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !171, file: !54, line: 420, baseType: !179, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "crc_cls", scope: !171, file: !54, line: 426, baseType: !144, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !171, file: !54, line: 432, baseType: !188, size: 64, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_ContentReaderCallback", file: !4, line: 2376, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!192, !144, !195, !179, !150}
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !193, line: 77, baseType: !194)
!193 = !DIFile(filename: "/nix/store/q141hd8jl7in5223jmf7kmx9h517km4p-glibc-2.32-54-dev/include/stdio.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !148, line: 194, baseType: !149)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !156, line: 27, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !148, line: 45, baseType: !152)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "crfc", scope: !171, file: !54, line: 438, baseType: !198, size: 64, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_ContentReaderFreeCallback", file: !4, line: 2392, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !144}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "upgrade_handler", scope: !171, file: !54, line: 446, baseType: !203, size: 64, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_UpgradeHandler", file: !4, line: 3429, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !144, !207, !144, !225, !150, !322, !246}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MHD_Connection", file: !54, line: 739, size: 3392, elements: !209)
!209 = !{!210, !211, !212, !213, !214, !215, !216, !412, !413, !414, !415, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !481, !482, !483, !484}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "nextE", scope: !208, file: !54, line: 746, baseType: !207, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "prevE", scope: !208, file: !54, line: 751, baseType: !207, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !208, file: !54, line: 757, baseType: !207, size: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !208, file: !54, line: 762, baseType: !207, size: 64, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "nextX", scope: !208, file: !54, line: 771, baseType: !207, size: 64, offset: 256)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "prevX", scope: !208, file: !54, line: 776, baseType: !207, size: 64, offset: 320)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "daemon", scope: !208, file: !54, line: 781, baseType: !217, size: 64, offset: 384)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MHD_Daemon", file: !54, line: 1392, size: 4928, elements: !219)
!219 = !{!220, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !245, !253, !254, !255, !256, !257, !258, !279, !280, !285, !286, !291, !292, !297, !298, !303, !304, !307, !319, !320, !321, !323, !324, !325, !326, !327, !328, !329, !330, !341, !372, !373, !374, !375, !376, !381, !382, !383, !384, !385, !386, !387, !388, !392, !393, !394, !395, !396, !406, !407, !408, !409, !410, !411}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "default_handler", scope: !218, file: !54, line: 1398, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_AccessHandlerCallback", file: !4, line: 2227, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!3, !144, !207, !225, !225, !225, !225, !227, !228}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "default_handler_cls", scope: !218, file: !54, line: 1403, baseType: !144, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !218, file: !54, line: 1411, baseType: !17, size: 32, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "new_connections_head", scope: !218, file: !54, line: 1416, baseType: !207, size: 64, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "new_connections_tail", scope: !218, file: !54, line: 1421, baseType: !207, size: 64, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "connections_head", scope: !218, file: !54, line: 1426, baseType: !207, size: 64, offset: 320)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "connections_tail", scope: !218, file: !54, line: 1431, baseType: !207, size: 64, offset: 384)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "suspended_connections_head", scope: !218, file: !54, line: 1436, baseType: !207, size: 64, offset: 448)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "suspended_connections_tail", scope: !218, file: !54, line: 1441, baseType: !207, size: 64, offset: 512)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup_head", scope: !218, file: !54, line: 1446, baseType: !207, size: 64, offset: 576)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup_tail", scope: !218, file: !54, line: 1451, baseType: !207, size: 64, offset: 640)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "listen_is_unix", scope: !218, file: !54, line: 1456, baseType: !53, size: 32, offset: 704)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "eready_head", scope: !218, file: !54, line: 1462, baseType: !207, size: 64, offset: 768)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "eready_tail", scope: !218, file: !54, line: 1467, baseType: !207, size: 64, offset: 832)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !218, file: !54, line: 1475, baseType: !55, size: 32, offset: 896)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "listen_socket_in_epoll", scope: !218, file: !54, line: 1481, baseType: !244, size: 8, offset: 928)
!244 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "eready_urh_head", scope: !218, file: !54, line: 1501, baseType: !246, size: 64, offset: 960)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MHD_UpgradeResponseHandle", file: !54, line: 1217, size: 128, elements: !248)
!248 = !{!249, !250, !252}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !247, file: !54, line: 1224, baseType: !207, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "was_closed", scope: !247, file: !54, line: 1329, baseType: !251, size: 8, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !244)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "clean_ready", scope: !247, file: !54, line: 1352, baseType: !251, size: 8, offset: 72)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "eready_urh_tail", scope: !218, file: !54, line: 1506, baseType: !246, size: 64, offset: 1024)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "normal_timeout_head", scope: !218, file: !54, line: 1524, baseType: !207, size: 64, offset: 1088)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "normal_timeout_tail", scope: !218, file: !54, line: 1531, baseType: !207, size: 64, offset: 1152)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "manual_timeout_head", scope: !218, file: !54, line: 1539, baseType: !207, size: 64, offset: 1216)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "manual_timeout_tail", scope: !218, file: !54, line: 1546, baseType: !207, size: 64, offset: 1280)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "apc", scope: !218, file: !54, line: 1552, baseType: !259, size: 64, offset: 1344)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_AcceptPolicyCallback", file: !4, line: 2182, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!3, !144, !263, !276}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !266, line: 178, size: 128, elements: !267)
!266 = !DIFile(filename: "/nix/store/q141hd8jl7in5223jmf7kmx9h517km4p-glibc-2.32-54-dev/include/bits/socket.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!267 = !{!268, !272}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !265, file: !266, line: 180, baseType: !269, size: 16)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !270, line: 28, baseType: !271)
!270 = !DIFile(filename: "/nix/store/q141hd8jl7in5223jmf7kmx9h517km4p-glibc-2.32-54-dev/include/bits/sockaddr.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!271 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !265, file: !266, line: 181, baseType: !273, size: 112, offset: 16)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 112, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 14)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !277, line: 274, baseType: !278)
!277 = !DIFile(filename: "/nix/store/q141hd8jl7in5223jmf7kmx9h517km4p-glibc-2.32-54-dev/include/unistd.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !148, line: 210, baseType: !5)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "apc_cls", scope: !218, file: !54, line: 1557, baseType: !144, size: 64, offset: 1408)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "notify_completed", scope: !218, file: !54, line: 1563, baseType: !281, size: 64, offset: 1472)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_RequestCompletedCallback", file: !4, line: 2250, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{null, !144, !207, !228, !62}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "notify_completed_cls", scope: !218, file: !54, line: 1568, baseType: !144, size: 64, offset: 1536)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "notify_connection", scope: !218, file: !54, line: 1574, baseType: !287, size: 64, offset: 1600)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_NotifyConnectionCallback", file: !4, line: 2276, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{null, !144, !207, !228, !70}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "notify_connection_cls", scope: !218, file: !54, line: 1579, baseType: !144, size: 64, offset: 1664)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "uri_log_callback", scope: !218, file: !54, line: 1588, baseType: !293, size: 64, offset: 1728)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "LogCallback", file: !54, line: 1366, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!144, !144, !225, !207}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "uri_log_callback_cls", scope: !218, file: !54, line: 1593, baseType: !144, size: 64, offset: 1792)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "unescape_callback", scope: !218, file: !54, line: 1598, baseType: !299, size: 64, offset: 1856)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "UnescapeCallback", file: !54, line: 1380, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!150, !144, !207, !179}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "unescape_callback_cls", scope: !218, file: !54, line: 1603, baseType: !144, size: 64, offset: 1920)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !218, file: !54, line: 1611, baseType: !305, size: 16, offset: 1984)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !156, line: 25, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !148, line: 40, baseType: !271)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "custom_error_log", scope: !218, file: !54, line: 1618, baseType: !308, size: 64, offset: 2048)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_LogCallback", file: !4, line: 1349, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{null, !144, !225, !312}
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !314)
!314 = !{!315, !316, !317, !318}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !313, file: !1, baseType: !5, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !313, file: !1, baseType: !5, size: 32, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !313, file: !1, baseType: !144, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !313, file: !1, baseType: !144, size: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "custom_error_log_cls", scope: !218, file: !54, line: 1623, baseType: !144, size: 64, offset: 2112)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !218, file: !54, line: 1629, baseType: !217, size: 64, offset: 2176)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "listen_fd", scope: !218, file: !54, line: 1637, baseType: !322, size: 32, offset: 2240)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_socket", file: !4, line: 193, baseType: !55)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "worker_pool", scope: !218, file: !54, line: 1643, baseType: !217, size: 64, offset: 2304)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "per_ip_connection_count", scope: !218, file: !54, line: 1649, baseType: !144, size: 64, offset: 2368)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !218, file: !54, line: 1657, baseType: !5, size: 32, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !218, file: !54, line: 1662, baseType: !150, size: 64, offset: 2496)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "pool_increment", scope: !218, file: !54, line: 1667, baseType: !150, size: 64, offset: 2560)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "thread_stack_size", scope: !218, file: !54, line: 1673, baseType: !150, size: 64, offset: 2624)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "worker_pool_size", scope: !218, file: !54, line: 1678, baseType: !5, size: 32, offset: 2688)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !218, file: !54, line: 1683, baseType: !331, size: 128, offset: 2752)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_thread_handle_ID_", file: !332, line: 127, baseType: !333)
!332 = !DIFile(filename: "src/microhttpd/mhd_threads.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MHD_thread_handle_ID_", file: !332, line: 122, size: 128, elements: !334)
!334 = !{!335, !339}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !333, file: !332, line: 124, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_thread_handle_", file: !332, line: 84, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !338, line: 27, baseType: !152)
!338 = !DIFile(filename: "/nix/store/q141hd8jl7in5223jmf7kmx9h517km4p-glibc-2.32-54-dev/include/bits/pthreadtypes.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !333, file: !332, line: 125, baseType: !340, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_thread_ID_", file: !332, line: 98, baseType: !337)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "per_ip_connection_mutex", scope: !218, file: !54, line: 1688, baseType: !342, size: 320, offset: 2880)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_mutex_", file: !343, line: 70, baseType: !344)
!343 = !DIFile(filename: "src/microhttpd/mhd_locks.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !338, line: 72, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !338, line: 67, size: 320, elements: !346)
!346 = !{!347, !367, !371}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !345, file: !338, line: 69, baseType: !348, size: 320)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !349, line: 22, size: 320, elements: !350)
!349 = !DIFile(filename: "/nix/store/q141hd8jl7in5223jmf7kmx9h517km4p-glibc-2.32-54-dev/include/bits/struct_mutex.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!350 = !{!351, !352, !353, !354, !355, !356, !358, !359}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !348, file: !349, line: 24, baseType: !55, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !348, file: !349, line: 25, baseType: !5, size: 32, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !348, file: !349, line: 26, baseType: !55, size: 32, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !348, file: !349, line: 28, baseType: !5, size: 32, offset: 96)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !348, file: !349, line: 32, baseType: !55, size: 32, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !348, file: !349, line: 34, baseType: !357, size: 16, offset: 160)
!357 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !348, file: !349, line: 35, baseType: !357, size: 16, offset: 176)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !348, file: !349, line: 36, baseType: !360, size: 128, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !361, line: 53, baseType: !362)
!361 = !DIFile(filename: "/nix/store/q141hd8jl7in5223jmf7kmx9h517km4p-glibc-2.32-54-dev/include/bits/thread-shared-types.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !361, line: 49, size: 128, elements: !363)
!363 = !{!364, !366}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !362, file: !361, line: 51, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !362, file: !361, line: 52, baseType: !365, size: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !345, file: !338, line: 70, baseType: !368, size: 320)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 320, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 40)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !345, file: !338, line: 71, baseType: !149, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup_connection_mutex", scope: !218, file: !54, line: 1694, baseType: !342, size: 320, offset: 3200)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "new_connections_mutex", scope: !218, file: !54, line: 1699, baseType: !342, size: 320, offset: 3520)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "insanity_level", scope: !218, file: !54, line: 1706, baseType: !74, size: 32, offset: 3840)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "listening_address_reuse", scope: !218, file: !54, line: 1717, baseType: !55, size: 32, offset: 3872)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "itc", scope: !218, file: !54, line: 1724, baseType: !377, size: 32, offset: 3904)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MHD_itc_", file: !378, line: 45, size: 32, elements: !379)
!378 = !DIFile(filename: "src/microhttpd/mhd_itc_types.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!379 = !{!380}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !377, file: !378, line: 47, baseType: !55, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !218, file: !54, line: 1729, baseType: !251, size: 8, offset: 3936)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "was_quiesced", scope: !218, file: !54, line: 1736, baseType: !251, size: 8, offset: 3944)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "at_limit", scope: !218, file: !54, line: 1745, baseType: !244, size: 8, offset: 3952)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "resuming", scope: !218, file: !54, line: 1750, baseType: !251, size: 8, offset: 3960)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "have_new", scope: !218, file: !54, line: 1756, baseType: !251, size: 8, offset: 3968)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "data_already_pending", scope: !218, file: !54, line: 1767, baseType: !244, size: 8, offset: 3976)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "connection_limit", scope: !218, file: !54, line: 1772, baseType: !5, size: 32, offset: 4000)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "connection_timeout", scope: !218, file: !54, line: 1778, baseType: !389, size: 64, offset: 4032)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !390, line: 7, baseType: !391)
!390 = !DIFile(filename: "/nix/store/q141hd8jl7in5223jmf7kmx9h517km4p-glibc-2.32-54-dev/include/bits/types/time_t.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !148, line: 160, baseType: !149)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "per_ip_connection_limit", scope: !218, file: !54, line: 1784, baseType: !5, size: 32, offset: 4096)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "strict_for_client", scope: !218, file: !54, line: 1789, baseType: !55, size: 32, offset: 4128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "sigpipe_blocked", scope: !218, file: !54, line: 1794, baseType: !244, size: 8, offset: 4160)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "digest_auth_random", scope: !218, file: !54, line: 1907, baseType: !225, size: 64, offset: 4224)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "nnc", scope: !218, file: !54, line: 1912, baseType: !397, size: 64, offset: 4288)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MHD_NonceNc", file: !54, line: 275, size: 1216, elements: !399)
!399 = !{!400, !401, !402}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !398, file: !54, line: 282, baseType: !195, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "nmask", scope: !398, file: !54, line: 288, baseType: !195, size: 64, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "nonce", scope: !398, file: !54, line: 293, baseType: !403, size: 1032, offset: 128)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 1032, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 129)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "nnc_lock", scope: !218, file: !54, line: 1918, baseType: !342, size: 320, offset: 4352)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "digest_auth_rand_size", scope: !218, file: !54, line: 1924, baseType: !150, size: 64, offset: 4672)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "nonce_nc_size", scope: !218, file: !54, line: 1929, baseType: !5, size: 32, offset: 4736)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "fastopen_queue_size", scope: !218, file: !54, line: 1937, baseType: !5, size: 32, offset: 4768)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "listen_backlog_size", scope: !218, file: !54, line: 1943, baseType: !5, size: 32, offset: 4800)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "num_opts", scope: !218, file: !54, line: 1952, baseType: !150, size: 64, offset: 4864)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "headers_received", scope: !208, file: !54, line: 786, baseType: !174, size: 64, offset: 448)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "headers_received_tail", scope: !208, file: !54, line: 791, baseType: !174, size: 64, offset: 512)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "response", scope: !208, file: !54, line: 796, baseType: !170, size: 64, offset: 576)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !208, file: !54, line: 806, baseType: !416, size: 64, offset: 640)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryPool", file: !54, line: 806, flags: DIFlagFwdDecl)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "client_context", scope: !208, file: !54, line: 814, baseType: !144, size: 64, offset: 704)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "socket_context", scope: !208, file: !54, line: 823, baseType: !144, size: 64, offset: 768)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !208, file: !54, line: 828, baseType: !179, size: 64, offset: 832)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !208, file: !54, line: 834, baseType: !225, size: 64, offset: 896)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !208, file: !54, line: 840, baseType: !179, size: 64, offset: 960)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !208, file: !54, line: 847, baseType: !77, size: 32, offset: 1024)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "read_buffer", scope: !208, file: !54, line: 854, baseType: !179, size: 64, offset: 1088)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "write_buffer", scope: !208, file: !54, line: 860, baseType: !179, size: 64, offset: 1152)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !208, file: !54, line: 868, baseType: !179, size: 64, offset: 1216)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "colon", scope: !208, file: !54, line: 877, baseType: !179, size: 64, offset: 1280)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !208, file: !54, line: 883, baseType: !429, size: 64, offset: 1344)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !208, file: !54, line: 890, baseType: !331, size: 128, offset: 1408)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "read_buffer_size", scope: !208, file: !54, line: 899, baseType: !150, size: 64, offset: 1536)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "read_buffer_offset", scope: !208, file: !54, line: 905, baseType: !150, size: 64, offset: 1600)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "write_buffer_size", scope: !208, file: !54, line: 910, baseType: !150, size: 64, offset: 1664)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "write_buffer_send_offset", scope: !208, file: !54, line: 915, baseType: !150, size: 64, offset: 1728)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "write_buffer_append_offset", scope: !208, file: !54, line: 921, baseType: !150, size: 64, offset: 1792)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "header_size", scope: !208, file: !54, line: 927, baseType: !150, size: 64, offset: 1856)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "remaining_upload_size", scope: !208, file: !54, line: 933, baseType: !195, size: 64, offset: 1920)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "response_write_position", scope: !208, file: !54, line: 940, baseType: !195, size: 64, offset: 1984)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "resp_iov", scope: !208, file: !54, line: 948, baseType: !440, size: 192, offset: 2048)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MHD_iovec_track_", file: !54, line: 380, size: 192, elements: !441)
!441 = !{!442, !450, !451}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "iov", scope: !440, file: !54, line: 387, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_iovec_", file: !54, line: 366, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !446, line: 26, size: 128, elements: !447)
!446 = !DIFile(filename: "/nix/store/q141hd8jl7in5223jmf7kmx9h517km4p-glibc-2.32-54-dev/include/bits/types/struct_iovec.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!447 = !{!448, !449}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !445, file: !446, line: 28, baseType: !144, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !445, file: !446, line: 29, baseType: !150, size: 64, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "cnt", scope: !440, file: !54, line: 393, baseType: !150, size: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !440, file: !54, line: 400, baseType: !150, size: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "resp_sender", scope: !208, file: !54, line: 956, baseType: !82, size: 32, offset: 2240)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "continue_message_write_offset", scope: !208, file: !54, line: 963, baseType: !150, size: 64, offset: 2304)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "addr_len", scope: !208, file: !54, line: 968, baseType: !276, size: 32, offset: 2368)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "last_activity", scope: !208, file: !54, line: 974, baseType: !389, size: 64, offset: 2432)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "connection_timeout", scope: !208, file: !54, line: 980, baseType: !389, size: 64, offset: 2496)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "connection_timeout_dummy", scope: !208, file: !54, line: 985, baseType: !5, size: 32, offset: 2560)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "client_aware", scope: !208, file: !54, line: 992, baseType: !244, size: 8, offset: 2592)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "socket_fd", scope: !208, file: !54, line: 999, baseType: !322, size: 32, offset: 2624)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "is_nonip", scope: !208, file: !54, line: 1005, baseType: !53, size: 32, offset: 2656)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "sk_nonblck", scope: !208, file: !54, line: 1010, baseType: !244, size: 8, offset: 2688)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "sk_spipe_suppress", scope: !208, file: !54, line: 1015, baseType: !244, size: 8, offset: 2696)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "sk_corked", scope: !208, file: !54, line: 1020, baseType: !53, size: 32, offset: 2720)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "sk_nodelay", scope: !208, file: !54, line: 1025, baseType: !53, size: 32, offset: 2752)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "read_closed", scope: !208, file: !54, line: 1033, baseType: !244, size: 8, offset: 2784)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "thread_joined", scope: !208, file: !54, line: 1039, baseType: !244, size: 8, offset: 2792)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "in_idle", scope: !208, file: !54, line: 1046, baseType: !244, size: 8, offset: 2800)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "in_cleanup", scope: !208, file: !54, line: 1052, baseType: !244, size: 8, offset: 2808)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_state", scope: !208, file: !54, line: 1058, baseType: !86, size: 32, offset: 2816)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !208, file: !54, line: 1064, baseType: !95, size: 32, offset: 2848)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "event_loop_info", scope: !208, file: !54, line: 1069, baseType: !118, size: 32, offset: 2880)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "responseCode", scope: !208, file: !54, line: 1075, baseType: !5, size: 32, offset: 2912)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "have_chunked_upload", scope: !208, file: !54, line: 1084, baseType: !244, size: 8, offset: 2944)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "current_chunk_size", scope: !208, file: !54, line: 1092, baseType: !195, size: 64, offset: 3008)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "current_chunk_offset", scope: !208, file: !54, line: 1098, baseType: !195, size: 64, offset: 3072)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "recv_cls", scope: !208, file: !54, line: 1103, baseType: !477, size: 64, offset: 3136)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "ReceiveCallback", file: !54, line: 695, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!192, !207, !144, !150}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "urh", scope: !208, file: !54, line: 1112, baseType: !246, size: 64, offset: 3200)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "suspended", scope: !208, file: !54, line: 1147, baseType: !244, size: 8, offset: 3264)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "suspended_dummy", scope: !208, file: !54, line: 1152, baseType: !55, size: 32, offset: 3296)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "resuming", scope: !208, file: !54, line: 1157, baseType: !251, size: 8, offset: 3328)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "upgrade_handler_cls", scope: !171, file: !54, line: 451, baseType: !144, size: 64, offset: 384)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !171, file: !54, line: 459, baseType: !342, size: 320, offset: 448)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "total_size", scope: !171, file: !54, line: 465, baseType: !195, size: 64, offset: 768)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "data_start", scope: !171, file: !54, line: 471, baseType: !195, size: 64, offset: 832)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "fd_off", scope: !171, file: !54, line: 476, baseType: !195, size: 64, offset: 896)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !171, file: !54, line: 482, baseType: !150, size: 64, offset: 960)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "data_buffer_size", scope: !171, file: !54, line: 487, baseType: !150, size: 64, offset: 1024)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !171, file: !54, line: 493, baseType: !5, size: 32, offset: 1088)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !171, file: !54, line: 498, baseType: !55, size: 32, offset: 1120)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !171, file: !54, line: 503, baseType: !124, size: 32, offset: 1152)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "is_pipe", scope: !171, file: !54, line: 508, baseType: !244, size: 8, offset: 1184)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "data_iov", scope: !171, file: !54, line: 513, baseType: !443, size: 64, offset: 1216)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "data_iovcnt", scope: !171, file: !54, line: 518, baseType: !5, size: 32, offset: 1280)
!498 = !{!499, !500, !501}
!499 = !DILocalVariable(name: "response", arg: 1, scope: !167, file: !1, line: 134, type: !170)
!500 = !DILocalVariable(name: "header", arg: 2, scope: !167, file: !1, line: 135, type: !225)
!501 = !DILocalVariable(name: "content", arg: 3, scope: !167, file: !1, line: 136, type: !225)
!502 = !DILocation(line: 134, column: 47, scope: !167)
!503 = !DILocation(line: 135, column: 38, scope: !167)
!504 = !DILocation(line: 136, column: 38, scope: !167)
!505 = !DILocation(line: 138, column: 9, scope: !506)
!506 = distinct !DILexicalBlock(scope: !167, file: !1, line: 138, column: 8)
!507 = !DILocation(line: 139, column: 70, scope: !506)
!508 = !DILocation(line: 140, column: 11, scope: !506)
!509 = !DILocation(line: 141, column: 49, scope: !506)
!510 = !DILocation(line: 142, column: 11, scope: !506)
!511 = !DILocation(line: 138, column: 8, scope: !167)
!512 = !DILocation(line: 152, column: 27, scope: !513)
!513 = distinct !DILexicalBlock(scope: !167, file: !1, line: 151, column: 8)
!514 = !{!515, !517, i64 144}
!515 = !{!"MHD_Response", !516, i64 0, !516, i64 8, !516, i64 16, !516, i64 24, !516, i64 32, !516, i64 40, !516, i64 48, !517, i64 56, !519, i64 96, !519, i64 104, !519, i64 112, !519, i64 120, !519, i64 128, !520, i64 136, !520, i64 140, !517, i64 144, !521, i64 148, !516, i64 152, !520, i64 160}
!516 = !{!"any pointer", !517, i64 0}
!517 = !{!"omnipotent char", !518, i64 0}
!518 = !{!"Simple C/C++ TBAA"}
!519 = !{!"long", !517, i64 0}
!520 = !{!"int", !517, i64 0}
!521 = !{!"_Bool", !517, i64 0}
!522 = !DILocation(line: 152, column: 15, scope: !513)
!523 = !DILocation(line: 151, column: 11, scope: !513)
!524 = !DILocation(line: 152, column: 35, scope: !513)
!525 = !DILocation(line: 153, column: 9, scope: !513)
!526 = !DILocation(line: 151, column: 8, scope: !167)
!527 = !DILocation(line: 161, column: 10, scope: !167)
!528 = !DILocation(line: 161, column: 3, scope: !167)
!529 = !DILocation(line: 0, scope: !530)
!530 = distinct !DILexicalBlock(scope: !506, file: !1, line: 144, column: 3)
!531 = !DILocation(line: 165, column: 1, scope: !167)
!532 = distinct !DISubprogram(name: "add_response_entry", scope: !1, file: !1, line: 83, type: !533, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !535)
!533 = !DISubroutineType(types: !534)
!534 = !{!3, !170, !9, !225, !225}
!535 = !{!536, !537, !538, !539, !540}
!536 = !DILocalVariable(name: "response", arg: 1, scope: !532, file: !1, line: 83, type: !170)
!537 = !DILocalVariable(name: "kind", arg: 2, scope: !532, file: !1, line: 84, type: !9)
!538 = !DILocalVariable(name: "header", arg: 3, scope: !532, file: !1, line: 85, type: !225)
!539 = !DILocalVariable(name: "content", arg: 4, scope: !532, file: !1, line: 86, type: !225)
!540 = !DILocalVariable(name: "hdr", scope: !532, file: !1, line: 88, type: !174)
!541 = !DILocation(line: 83, column: 42, scope: !532)
!542 = !DILocation(line: 84, column: 40, scope: !532)
!543 = !DILocation(line: 85, column: 33, scope: !532)
!544 = !DILocation(line: 86, column: 33, scope: !532)
!545 = !DILocation(line: 90, column: 14, scope: !546)
!546 = distinct !DILexicalBlock(scope: !532, file: !1, line: 90, column: 8)
!547 = !DILocation(line: 91, column: 14, scope: !546)
!548 = !DILocation(line: 90, column: 27, scope: !546)
!549 = !DILocation(line: 92, column: 14, scope: !546)
!550 = !DILocation(line: 93, column: 14, scope: !546)
!551 = !{!517, !517, i64 0}
!552 = !DILocation(line: 93, column: 11, scope: !546)
!553 = !DILocation(line: 93, column: 25, scope: !546)
!554 = !DILocation(line: 94, column: 14, scope: !546)
!555 = !DILocation(line: 94, column: 11, scope: !546)
!556 = !DILocation(line: 94, column: 26, scope: !546)
!557 = !DILocation(line: 95, column: 17, scope: !546)
!558 = !DILocation(line: 95, column: 14, scope: !546)
!559 = !DILocation(line: 95, column: 40, scope: !546)
!560 = !DILocation(line: 96, column: 17, scope: !546)
!561 = !DILocation(line: 96, column: 14, scope: !546)
!562 = !DILocation(line: 96, column: 40, scope: !546)
!563 = !DILocation(line: 97, column: 17, scope: !546)
!564 = !DILocation(line: 97, column: 14, scope: !546)
!565 = !DILocation(line: 97, column: 40, scope: !546)
!566 = !DILocation(line: 98, column: 17, scope: !546)
!567 = !DILocation(line: 98, column: 14, scope: !546)
!568 = !DILocation(line: 98, column: 41, scope: !546)
!569 = !DILocation(line: 99, column: 17, scope: !546)
!570 = !DILocation(line: 99, column: 14, scope: !546)
!571 = !DILocation(line: 99, column: 41, scope: !546)
!572 = !DILocation(line: 100, column: 17, scope: !546)
!573 = !DILocation(line: 100, column: 14, scope: !546)
!574 = !DILocation(line: 90, column: 8, scope: !532)
!575 = !DILocation(line: 102, column: 22, scope: !576)
!576 = distinct !DILexicalBlock(scope: !532, file: !1, line: 102, column: 7)
!577 = !DILocation(line: 88, column: 27, scope: !532)
!578 = !DILocation(line: 102, column: 12, scope: !576)
!579 = !DILocation(line: 102, column: 7, scope: !532)
!580 = !DILocation(line: 104, column: 30, scope: !581)
!581 = distinct !DILexicalBlock(scope: !532, file: !1, line: 104, column: 7)
!582 = !DILocation(line: 104, column: 21, scope: !581)
!583 = !DILocation(line: 104, column: 28, scope: !581)
!584 = !{!585, !516, i64 8}
!585 = !{!"MHD_HTTP_Header", !516, i64 0, !516, i64 8, !519, i64 16, !516, i64 24, !519, i64 32, !517, i64 40}
!586 = !DILocation(line: 104, column: 12, scope: !581)
!587 = !DILocation(line: 104, column: 7, scope: !532)
!588 = !DILocation(line: 106, column: 5, scope: !589)
!589 = distinct !DILexicalBlock(scope: !581, file: !1, line: 105, column: 3)
!590 = !DILocation(line: 107, column: 5, scope: !589)
!591 = !DILocation(line: 109, column: 22, scope: !532)
!592 = !DILocation(line: 109, column: 8, scope: !532)
!593 = !DILocation(line: 109, column: 20, scope: !532)
!594 = !{!585, !519, i64 16}
!595 = !DILocation(line: 110, column: 29, scope: !596)
!596 = distinct !DILexicalBlock(scope: !532, file: !1, line: 110, column: 7)
!597 = !DILocation(line: 110, column: 21, scope: !596)
!598 = !DILocation(line: 110, column: 27, scope: !596)
!599 = !{!585, !516, i64 24}
!600 = !DILocation(line: 110, column: 12, scope: !596)
!601 = !DILocation(line: 110, column: 7, scope: !532)
!602 = !DILocation(line: 112, column: 5, scope: !603)
!603 = distinct !DILexicalBlock(scope: !596, file: !1, line: 111, column: 3)
!604 = !DILocation(line: 113, column: 5, scope: !603)
!605 = !DILocation(line: 114, column: 5, scope: !603)
!606 = !DILocation(line: 116, column: 21, scope: !532)
!607 = !DILocation(line: 116, column: 8, scope: !532)
!608 = !DILocation(line: 116, column: 19, scope: !532)
!609 = !{!585, !519, i64 32}
!610 = !DILocation(line: 117, column: 8, scope: !532)
!611 = !DILocation(line: 117, column: 13, scope: !532)
!612 = !{!585, !517, i64 40}
!613 = !DILocation(line: 118, column: 25, scope: !532)
!614 = !{!515, !516, i64 0}
!615 = !DILocation(line: 118, column: 13, scope: !532)
!616 = !{!585, !516, i64 0}
!617 = !DILocation(line: 119, column: 26, scope: !532)
!618 = !DILocation(line: 120, column: 3, scope: !532)
!619 = !DILocation(line: 0, scope: !532)
!620 = !DILocation(line: 121, column: 1, scope: !532)
!621 = distinct !DISubprogram(name: "MHD_add_response_footer", scope: !1, file: !1, line: 178, type: !168, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !622)
!622 = !{!623, !624, !625}
!623 = !DILocalVariable(name: "response", arg: 1, scope: !621, file: !1, line: 178, type: !170)
!624 = !DILocalVariable(name: "footer", arg: 2, scope: !621, file: !1, line: 179, type: !225)
!625 = !DILocalVariable(name: "content", arg: 3, scope: !621, file: !1, line: 180, type: !225)
!626 = !DILocation(line: 178, column: 47, scope: !621)
!627 = !DILocation(line: 179, column: 38, scope: !621)
!628 = !DILocation(line: 180, column: 38, scope: !621)
!629 = !DILocation(line: 182, column: 10, scope: !621)
!630 = !DILocation(line: 182, column: 3, scope: !621)
!631 = distinct !DISubprogram(name: "MHD_del_response_header", scope: !1, file: !1, line: 199, type: !168, isLocal: false, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !632)
!632 = !{!633, !634, !635, !636, !637, !638, !639}
!633 = !DILocalVariable(name: "response", arg: 1, scope: !631, file: !1, line: 199, type: !170)
!634 = !DILocalVariable(name: "header", arg: 2, scope: !631, file: !1, line: 200, type: !225)
!635 = !DILocalVariable(name: "content", arg: 3, scope: !631, file: !1, line: 201, type: !225)
!636 = !DILocalVariable(name: "pos", scope: !631, file: !1, line: 203, type: !174)
!637 = !DILocalVariable(name: "prev", scope: !631, file: !1, line: 204, type: !174)
!638 = !DILocalVariable(name: "header_len", scope: !631, file: !1, line: 205, type: !150)
!639 = !DILocalVariable(name: "content_len", scope: !631, file: !1, line: 206, type: !150)
!640 = !DILocation(line: 199, column: 47, scope: !631)
!641 = !DILocation(line: 200, column: 38, scope: !631)
!642 = !DILocation(line: 201, column: 38, scope: !631)
!643 = !DILocation(line: 208, column: 14, scope: !644)
!644 = distinct !DILexicalBlock(scope: !631, file: !1, line: 208, column: 8)
!645 = !DILocation(line: 209, column: 14, scope: !644)
!646 = !DILocation(line: 208, column: 25, scope: !644)
!647 = !DILocation(line: 211, column: 16, scope: !631)
!648 = !DILocation(line: 205, column: 10, scope: !631)
!649 = !DILocation(line: 212, column: 17, scope: !631)
!650 = !DILocation(line: 206, column: 10, scope: !631)
!651 = !DILocation(line: 204, column: 27, scope: !631)
!652 = !DILocation(line: 214, column: 19, scope: !631)
!653 = !DILocation(line: 203, column: 27, scope: !631)
!654 = !DILocation(line: 0, scope: !655)
!655 = distinct !DILexicalBlock(scope: !631, file: !1, line: 216, column: 3)
!656 = !{!516, !516, i64 0}
!657 = !DILocation(line: 215, column: 15, scope: !631)
!658 = !DILocation(line: 215, column: 3, scope: !631)
!659 = !DILocation(line: 217, column: 29, scope: !660)
!660 = distinct !DILexicalBlock(scope: !655, file: !1, line: 217, column: 9)
!661 = !DILocation(line: 217, column: 21, scope: !660)
!662 = !DILocation(line: 217, column: 42, scope: !660)
!663 = !DILocation(line: 218, column: 30, scope: !660)
!664 = !DILocation(line: 218, column: 22, scope: !660)
!665 = !DILocation(line: 218, column: 42, scope: !660)
!666 = !DILocation(line: 220, column: 28, scope: !660)
!667 = !DILocation(line: 219, column: 15, scope: !660)
!668 = !DILocation(line: 219, column: 12, scope: !660)
!669 = !DILocation(line: 221, column: 36, scope: !660)
!670 = !DILocation(line: 223, column: 28, scope: !660)
!671 = !DILocation(line: 222, column: 15, scope: !660)
!672 = !DILocation(line: 222, column: 12, scope: !660)
!673 = !DILocation(line: 217, column: 9, scope: !655)
!674 = !DILocation(line: 226, column: 7, scope: !675)
!675 = distinct !DILexicalBlock(scope: !660, file: !1, line: 225, column: 5)
!676 = !DILocation(line: 227, column: 18, scope: !675)
!677 = !DILocation(line: 227, column: 7, scope: !675)
!678 = !DILocation(line: 228, column: 16, scope: !679)
!679 = distinct !DILexicalBlock(scope: !675, file: !1, line: 228, column: 11)
!680 = !DILocation(line: 0, scope: !679)
!681 = !DILocation(line: 231, column: 20, scope: !679)
!682 = !DILocation(line: 229, column: 32, scope: !679)
!683 = !DILocation(line: 228, column: 11, scope: !675)
!684 = !DILocation(line: 232, column: 13, scope: !675)
!685 = !DILocation(line: 232, column: 7, scope: !675)
!686 = !DILocation(line: 233, column: 7, scope: !675)
!687 = !DILocation(line: 236, column: 16, scope: !655)
!688 = distinct !{!688, !658, !689}
!689 = !DILocation(line: 237, column: 3, scope: !631)
!690 = !DILocation(line: 0, scope: !631)
!691 = !DILocation(line: 239, column: 1, scope: !631)
!692 = distinct !DISubprogram(name: "MHD_get_response_headers", scope: !1, file: !1, line: 253, type: !693, isLocal: false, isDefinition: true, scopeLine: 256, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !699)
!693 = !DISubroutineType(types: !694)
!694 = !{!55, !170, !695, !144}
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "MHD_KeyValueIterator", file: !4, line: 2298, baseType: !696)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!3, !144, !9, !225, !225}
!699 = !{!700, !701, !702, !703, !704}
!700 = !DILocalVariable(name: "response", arg: 1, scope: !692, file: !1, line: 253, type: !170)
!701 = !DILocalVariable(name: "iterator", arg: 2, scope: !692, file: !1, line: 254, type: !695)
!702 = !DILocalVariable(name: "iterator_cls", arg: 3, scope: !692, file: !1, line: 255, type: !144)
!703 = !DILocalVariable(name: "numHeaders", scope: !692, file: !1, line: 257, type: !55)
!704 = !DILocalVariable(name: "pos", scope: !692, file: !1, line: 258, type: !174)
!705 = !DILocation(line: 253, column: 48, scope: !692)
!706 = !DILocation(line: 254, column: 48, scope: !692)
!707 = !DILocation(line: 255, column: 33, scope: !692)
!708 = !DILocation(line: 257, column: 7, scope: !692)
!709 = !DILocation(line: 260, column: 24, scope: !710)
!710 = distinct !DILexicalBlock(scope: !692, file: !1, line: 260, column: 3)
!711 = !DILocation(line: 258, column: 27, scope: !692)
!712 = !DILocation(line: 0, scope: !713)
!713 = distinct !DILexicalBlock(scope: !710, file: !1, line: 260, column: 3)
!714 = !DILocation(line: 261, column: 13, scope: !713)
!715 = !DILocation(line: 260, column: 3, scope: !710)
!716 = !DILocation(line: 264, column: 15, scope: !717)
!717 = distinct !DILexicalBlock(scope: !713, file: !1, line: 263, column: 3)
!718 = !DILocation(line: 265, column: 28, scope: !719)
!719 = distinct !DILexicalBlock(scope: !717, file: !1, line: 265, column: 9)
!720 = !DILocation(line: 267, column: 35, scope: !719)
!721 = !DILocation(line: 268, column: 35, scope: !719)
!722 = !DILocation(line: 269, column: 35, scope: !719)
!723 = !DILocation(line: 266, column: 20, scope: !719)
!724 = !DILocation(line: 266, column: 17, scope: !719)
!725 = !DILocation(line: 265, column: 9, scope: !717)
!726 = !DILocation(line: 262, column: 19, scope: !713)
!727 = distinct !{!727, !715, !728}
!728 = !DILocation(line: 271, column: 3, scope: !710)
!729 = !DILocation(line: 0, scope: !692)
!730 = !DILocation(line: 272, column: 3, scope: !692)
!731 = distinct !DISubprogram(name: "MHD_get_response_header", scope: !1, file: !1, line: 285, type: !732, isLocal: false, isDefinition: true, scopeLine: 287, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !734)
!732 = !DISubroutineType(types: !733)
!733 = !{!225, !170, !225}
!734 = !{!735, !736, !737, !738}
!735 = !DILocalVariable(name: "response", arg: 1, scope: !731, file: !1, line: 285, type: !170)
!736 = !DILocalVariable(name: "key", arg: 2, scope: !731, file: !1, line: 286, type: !225)
!737 = !DILocalVariable(name: "pos", scope: !731, file: !1, line: 288, type: !174)
!738 = !DILocalVariable(name: "key_size", scope: !731, file: !1, line: 289, type: !150)
!739 = !DILocation(line: 285, column: 47, scope: !731)
!740 = !DILocation(line: 286, column: 38, scope: !731)
!741 = !DILocation(line: 291, column: 12, scope: !742)
!742 = distinct !DILexicalBlock(scope: !731, file: !1, line: 291, column: 7)
!743 = !DILocation(line: 291, column: 7, scope: !731)
!744 = !DILocation(line: 294, column: 14, scope: !731)
!745 = !DILocation(line: 289, column: 10, scope: !731)
!746 = !DILocation(line: 295, column: 24, scope: !747)
!747 = distinct !DILexicalBlock(scope: !731, file: !1, line: 295, column: 3)
!748 = !DILocation(line: 288, column: 27, scope: !731)
!749 = !DILocation(line: 0, scope: !750)
!750 = distinct !DILexicalBlock(scope: !747, file: !1, line: 295, column: 3)
!751 = !DILocation(line: 296, column: 13, scope: !750)
!752 = !DILocation(line: 295, column: 3, scope: !747)
!753 = !DILocation(line: 299, column: 15, scope: !754)
!754 = distinct !DILexicalBlock(scope: !755, file: !1, line: 299, column: 9)
!755 = distinct !DILexicalBlock(scope: !750, file: !1, line: 298, column: 3)
!756 = !DILocation(line: 299, column: 27, scope: !754)
!757 = !DILocation(line: 299, column: 40, scope: !754)
!758 = !DILocation(line: 300, column: 46, scope: !754)
!759 = !DILocation(line: 300, column: 10, scope: !754)
!760 = !DILocation(line: 299, column: 9, scope: !755)
!761 = !DILocation(line: 301, column: 19, scope: !754)
!762 = !DILocation(line: 301, column: 7, scope: !754)
!763 = !DILocation(line: 297, column: 19, scope: !750)
!764 = distinct !{!764, !752, !765}
!765 = !DILocation(line: 302, column: 3, scope: !747)
!766 = !DILocation(line: 0, scope: !731)
!767 = !DILocation(line: 304, column: 1, scope: !731)
!768 = distinct !DISubprogram(name: "MHD_check_response_header_token_ci", scope: !1, file: !1, line: 324, type: !769, isLocal: false, isDefinition: true, scopeLine: 329, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !773)
!769 = !DISubroutineType(types: !770)
!770 = !{!244, !771, !225, !150, !225, !150}
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!773 = !{!774, !775, !776, !777, !778, !779}
!774 = !DILocalVariable(name: "response", arg: 1, scope: !768, file: !1, line: 324, type: !771)
!775 = !DILocalVariable(name: "key", arg: 2, scope: !768, file: !1, line: 325, type: !225)
!776 = !DILocalVariable(name: "key_len", arg: 3, scope: !768, file: !1, line: 326, type: !150)
!777 = !DILocalVariable(name: "token", arg: 4, scope: !768, file: !1, line: 327, type: !225)
!778 = !DILocalVariable(name: "token_len", arg: 5, scope: !768, file: !1, line: 328, type: !150)
!779 = !DILocalVariable(name: "pos", scope: !768, file: !1, line: 330, type: !174)
!780 = !DILocation(line: 324, column: 64, scope: !768)
!781 = !DILocation(line: 325, column: 49, scope: !768)
!782 = !DILocation(line: 326, column: 44, scope: !768)
!783 = !DILocation(line: 327, column: 49, scope: !768)
!784 = !DILocation(line: 328, column: 44, scope: !768)
!785 = !DILocation(line: 332, column: 14, scope: !786)
!786 = distinct !DILexicalBlock(scope: !768, file: !1, line: 332, column: 8)
!787 = !DILocation(line: 332, column: 22, scope: !786)
!788 = !DILocation(line: 333, column: 17, scope: !786)
!789 = !DILocation(line: 333, column: 14, scope: !786)
!790 = !DILocation(line: 334, column: 14, scope: !786)
!791 = !DILocation(line: 333, column: 25, scope: !786)
!792 = !DILocation(line: 335, column: 17, scope: !786)
!793 = !DILocation(line: 335, column: 14, scope: !786)
!794 = !DILocation(line: 332, column: 8, scope: !768)
!795 = !DILocation(line: 341, column: 24, scope: !796)
!796 = distinct !DILexicalBlock(scope: !768, file: !1, line: 341, column: 3)
!797 = !DILocation(line: 330, column: 27, scope: !768)
!798 = !DILocation(line: 0, scope: !799)
!799 = distinct !DILexicalBlock(scope: !796, file: !1, line: 341, column: 3)
!800 = !DILocation(line: 342, column: 13, scope: !799)
!801 = !DILocation(line: 341, column: 3, scope: !796)
!802 = !DILocation(line: 345, column: 16, scope: !803)
!803 = distinct !DILexicalBlock(scope: !804, file: !1, line: 345, column: 10)
!804 = distinct !DILexicalBlock(scope: !799, file: !1, line: 344, column: 3)
!805 = !DILocation(line: 345, column: 21, scope: !803)
!806 = !DILocation(line: 345, column: 41, scope: !803)
!807 = !DILocation(line: 346, column: 27, scope: !803)
!808 = !DILocation(line: 346, column: 19, scope: !803)
!809 = !DILocation(line: 346, column: 40, scope: !803)
!810 = !DILocation(line: 347, column: 46, scope: !803)
!811 = !DILocation(line: 347, column: 10, scope: !803)
!812 = !DILocation(line: 349, column: 50, scope: !803)
!813 = !DILocation(line: 350, column: 44, scope: !803)
!814 = !DILocation(line: 350, column: 10, scope: !803)
!815 = !DILocation(line: 345, column: 10, scope: !804)
!816 = !DILocation(line: 343, column: 19, scope: !799)
!817 = distinct !{!817, !801, !818}
!818 = !DILocation(line: 354, column: 3, scope: !796)
!819 = !DILocation(line: 0, scope: !768)
!820 = !DILocation(line: 356, column: 1, scope: !768)
!821 = distinct !DISubprogram(name: "MHD_create_response_from_callback", scope: !1, file: !1, line: 376, type: !822, isLocal: false, isDefinition: true, scopeLine: 381, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !824)
!822 = !DISubroutineType(types: !823)
!823 = !{!170, !195, !150, !188, !144, !198}
!824 = !{!825, !826, !827, !828, !829, !830}
!825 = !DILocalVariable(name: "size", arg: 1, scope: !821, file: !1, line: 376, type: !195)
!826 = !DILocalVariable(name: "block_size", arg: 2, scope: !821, file: !1, line: 377, type: !150)
!827 = !DILocalVariable(name: "crc", arg: 3, scope: !821, file: !1, line: 378, type: !188)
!828 = !DILocalVariable(name: "crc_cls", arg: 4, scope: !821, file: !1, line: 379, type: !144)
!829 = !DILocalVariable(name: "crfc", arg: 5, scope: !821, file: !1, line: 380, type: !198)
!830 = !DILocalVariable(name: "response", scope: !821, file: !1, line: 382, type: !170)
!831 = !DILocation(line: 376, column: 45, scope: !821)
!832 = !DILocation(line: 377, column: 43, scope: !821)
!833 = !DILocation(line: 378, column: 62, scope: !821)
!834 = !DILocation(line: 379, column: 42, scope: !821)
!835 = !DILocation(line: 380, column: 66, scope: !821)
!836 = !DILocation(line: 384, column: 13, scope: !837)
!837 = distinct !DILexicalBlock(scope: !821, file: !1, line: 384, column: 7)
!838 = !DILocation(line: 384, column: 27, scope: !837)
!839 = !DILocation(line: 384, column: 21, scope: !837)
!840 = !DILocation(line: 386, column: 27, scope: !841)
!841 = distinct !DILexicalBlock(scope: !821, file: !1, line: 386, column: 7)
!842 = !DILocation(line: 382, column: 24, scope: !821)
!843 = !DILocation(line: 386, column: 12, scope: !841)
!844 = !DILocation(line: 386, column: 7, scope: !821)
!845 = !DILocation(line: 389, column: 13, scope: !821)
!846 = !DILocation(line: 389, column: 16, scope: !821)
!847 = !{!515, !520, i64 140}
!848 = !DILocation(line: 390, column: 30, scope: !821)
!849 = !DILocation(line: 390, column: 13, scope: !821)
!850 = !DILocation(line: 390, column: 18, scope: !821)
!851 = !{!515, !516, i64 8}
!852 = !DILocation(line: 391, column: 13, scope: !821)
!853 = !DILocation(line: 391, column: 30, scope: !821)
!854 = !{!515, !519, i64 128}
!855 = !DILocation(line: 393, column: 9, scope: !856)
!856 = distinct !DILexicalBlock(scope: !821, file: !1, line: 393, column: 7)
!857 = !DILocation(line: 393, column: 7, scope: !821)
!858 = !DILocation(line: 395, column: 5, scope: !859)
!859 = distinct !DILexicalBlock(scope: !856, file: !1, line: 394, column: 3)
!860 = !DILocation(line: 396, column: 5, scope: !859)
!861 = !DILocation(line: 399, column: 13, scope: !821)
!862 = !DILocation(line: 399, column: 17, scope: !821)
!863 = !{!515, !516, i64 24}
!864 = !DILocation(line: 400, column: 13, scope: !821)
!865 = !DILocation(line: 400, column: 18, scope: !821)
!866 = !{!515, !516, i64 32}
!867 = !DILocation(line: 401, column: 13, scope: !821)
!868 = !DILocation(line: 401, column: 21, scope: !821)
!869 = !{!515, !516, i64 16}
!870 = !DILocation(line: 402, column: 13, scope: !821)
!871 = !DILocation(line: 402, column: 29, scope: !821)
!872 = !{!515, !520, i64 136}
!873 = !DILocation(line: 403, column: 13, scope: !821)
!874 = !DILocation(line: 403, column: 24, scope: !821)
!875 = !{!515, !519, i64 96}
!876 = !DILocation(line: 404, column: 3, scope: !821)
!877 = !DILocation(line: 0, scope: !821)
!878 = !DILocation(line: 405, column: 1, scope: !821)
!879 = distinct !DISubprogram(name: "MHD_set_response_options", scope: !1, file: !1, line: 417, type: !880, isLocal: false, isDefinition: true, scopeLine: 420, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !882)
!880 = !DISubroutineType(types: !881)
!881 = !{!3, !170, !124, null}
!882 = !{!883, !884, !885, !893, !894}
!883 = !DILocalVariable(name: "response", arg: 1, scope: !879, file: !1, line: 417, type: !170)
!884 = !DILocalVariable(name: "flags", arg: 2, scope: !879, file: !1, line: 418, type: !124)
!885 = !DILocalVariable(name: "ap", scope: !879, file: !1, line: 421, type: !886)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !193, line: 52, baseType: !887)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !888, line: 48, baseType: !889)
!888 = !DIFile(filename: "/nix/store/9kpya70w4q7js35f34c572f1yyq0c2bh-clang-wrapper-7.1.0/resource-root/include/stdarg.h", directory: "/home/user/haskell/iiglue-bundle/examples/libmicrohttpd-0.9.73")
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 421, baseType: !890)
!890 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 192, elements: !891)
!891 = !{!892}
!892 = !DISubrange(count: 1)
!893 = !DILocalVariable(name: "ret", scope: !879, file: !1, line: 422, type: !3)
!894 = !DILocalVariable(name: "ro", scope: !879, file: !1, line: 423, type: !130)
!895 = !DILocation(line: 417, column: 48, scope: !879)
!896 = !DILocation(line: 418, column: 50, scope: !879)
!897 = !DILocation(line: 421, column: 3, scope: !879)
!898 = !DILocation(line: 421, column: 11, scope: !879)
!899 = !DILocation(line: 422, column: 19, scope: !879)
!900 = !DILocation(line: 426, column: 13, scope: !879)
!901 = !DILocation(line: 426, column: 19, scope: !879)
!902 = !DILocation(line: 427, column: 3, scope: !879)
!903 = !DILocation(line: 428, column: 30, scope: !879)
!904 = !DILocation(line: 423, column: 28, scope: !879)
!905 = !DILocation(line: 428, column: 21, scope: !879)
!906 = !DILocation(line: 428, column: 3, scope: !879)
!907 = distinct !{!907, !906, !908}
!908 = !DILocation(line: 436, column: 3, scope: !879)
!909 = distinct !{!909, !906, !908, !910}
!910 = !{!"llvm.loop.unroll.disable"}
!911 = !DILocation(line: 0, scope: !912)
!912 = distinct !DILexicalBlock(scope: !913, file: !1, line: 431, column: 5)
!913 = distinct !DILexicalBlock(scope: !879, file: !1, line: 429, column: 3)
!914 = !DILocation(line: 437, column: 3, scope: !879)
!915 = !DILocation(line: 439, column: 1, scope: !879)
!916 = !DILocation(line: 438, column: 3, scope: !879)
!917 = distinct !DISubprogram(name: "MHD_create_response_from_fd_at_offset", scope: !1, file: !1, line: 604, type: !918, isLocal: false, isDefinition: true, scopeLine: 607, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !922)
!918 = !DISubroutineType(types: !919)
!919 = !{!170, !150, !55, !920}
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !193, line: 63, baseType: !921)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !148, line: 152, baseType: !149)
!922 = !{!923, !924, !925}
!923 = !DILocalVariable(name: "size", arg: 1, scope: !917, file: !1, line: 604, type: !150)
!924 = !DILocalVariable(name: "fd", arg: 2, scope: !917, file: !1, line: 605, type: !55)
!925 = !DILocalVariable(name: "offset", arg: 3, scope: !917, file: !1, line: 606, type: !920)
!926 = !DILocation(line: 604, column: 47, scope: !917)
!927 = !DILocation(line: 605, column: 44, scope: !917)
!928 = !DILocation(line: 606, column: 46, scope: !917)
!929 = !DILocalVariable(name: "size", arg: 1, scope: !930, file: !1, line: 631, type: !195)
!930 = distinct !DISubprogram(name: "MHD_create_response_from_fd_at_offset64", scope: !1, file: !1, line: 631, type: !931, isLocal: false, isDefinition: true, scopeLine: 634, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !933)
!931 = !DISubroutineType(types: !932)
!932 = !{!170, !195, !55, !195}
!933 = !{!929, !934, !935, !936}
!934 = !DILocalVariable(name: "fd", arg: 2, scope: !930, file: !1, line: 632, type: !55)
!935 = !DILocalVariable(name: "offset", arg: 3, scope: !930, file: !1, line: 633, type: !195)
!936 = !DILocalVariable(name: "response", scope: !930, file: !1, line: 635, type: !170)
!937 = !DILocation(line: 631, column: 51, scope: !930, inlinedAt: !938)
!938 = distinct !DILocation(line: 608, column: 10, scope: !917)
!939 = !DILocation(line: 632, column: 46, scope: !930, inlinedAt: !938)
!940 = !DILocation(line: 633, column: 51, scope: !930, inlinedAt: !938)
!941 = !DILocation(line: 644, column: 29, scope: !942, inlinedAt: !938)
!942 = distinct !DILexicalBlock(scope: !930, file: !1, line: 644, column: 8)
!943 = !DILocation(line: 646, column: 25, scope: !942, inlinedAt: !938)
!944 = !DILocation(line: 376, column: 45, scope: !821, inlinedAt: !945)
!945 = distinct !DILocation(line: 649, column: 14, scope: !930, inlinedAt: !938)
!946 = !DILocation(line: 377, column: 43, scope: !821, inlinedAt: !945)
!947 = !DILocation(line: 378, column: 62, scope: !821, inlinedAt: !945)
!948 = !DILocation(line: 379, column: 42, scope: !821, inlinedAt: !945)
!949 = !DILocation(line: 380, column: 66, scope: !821, inlinedAt: !945)
!950 = !DILocation(line: 386, column: 27, scope: !841, inlinedAt: !945)
!951 = !DILocation(line: 382, column: 24, scope: !821, inlinedAt: !945)
!952 = !DILocation(line: 386, column: 12, scope: !841, inlinedAt: !945)
!953 = !DILocation(line: 386, column: 7, scope: !821, inlinedAt: !945)
!954 = !DILocation(line: 389, column: 13, scope: !821, inlinedAt: !945)
!955 = !DILocation(line: 389, column: 16, scope: !821, inlinedAt: !945)
!956 = !DILocation(line: 390, column: 30, scope: !821, inlinedAt: !945)
!957 = !DILocation(line: 390, column: 13, scope: !821, inlinedAt: !945)
!958 = !DILocation(line: 390, column: 18, scope: !821, inlinedAt: !945)
!959 = !DILocation(line: 391, column: 13, scope: !821, inlinedAt: !945)
!960 = !DILocation(line: 391, column: 30, scope: !821, inlinedAt: !945)
!961 = !DILocation(line: 393, column: 9, scope: !856, inlinedAt: !945)
!962 = !DILocation(line: 393, column: 7, scope: !821, inlinedAt: !945)
!963 = !DILocation(line: 395, column: 5, scope: !859, inlinedAt: !945)
!964 = !DILocation(line: 396, column: 5, scope: !859, inlinedAt: !945)
!965 = !DILocation(line: 399, column: 13, scope: !821, inlinedAt: !945)
!966 = !DILocation(line: 399, column: 17, scope: !821, inlinedAt: !945)
!967 = !DILocation(line: 400, column: 13, scope: !821, inlinedAt: !945)
!968 = !DILocation(line: 400, column: 18, scope: !821, inlinedAt: !945)
!969 = !DILocation(line: 401, column: 13, scope: !821, inlinedAt: !945)
!970 = !DILocation(line: 402, column: 13, scope: !821, inlinedAt: !945)
!971 = !DILocation(line: 402, column: 29, scope: !821, inlinedAt: !945)
!972 = !DILocation(line: 403, column: 13, scope: !821, inlinedAt: !945)
!973 = !DILocation(line: 403, column: 24, scope: !821, inlinedAt: !945)
!974 = !DILocation(line: 635, column: 24, scope: !930, inlinedAt: !938)
!975 = !DILocation(line: 656, column: 16, scope: !930, inlinedAt: !938)
!976 = !DILocation(line: 657, column: 13, scope: !930, inlinedAt: !938)
!977 = !DILocation(line: 657, column: 21, scope: !930, inlinedAt: !938)
!978 = !{!515, !521, i64 148}
!979 = !DILocation(line: 658, column: 13, scope: !930, inlinedAt: !938)
!980 = !DILocation(line: 658, column: 20, scope: !930, inlinedAt: !938)
!981 = !{!515, !519, i64 112}
!982 = !DILocation(line: 659, column: 21, scope: !930, inlinedAt: !938)
!983 = !DILocation(line: 660, column: 3, scope: !930, inlinedAt: !938)
!984 = !DILocation(line: 0, scope: !930, inlinedAt: !938)
!985 = !DILocation(line: 608, column: 3, scope: !917)
!986 = !DILocation(line: 631, column: 51, scope: !930)
!987 = !DILocation(line: 632, column: 46, scope: !930)
!988 = !DILocation(line: 633, column: 51, scope: !930)
!989 = !DILocation(line: 644, column: 29, scope: !942)
!990 = !DILocation(line: 646, column: 25, scope: !942)
!991 = !DILocation(line: 376, column: 45, scope: !821, inlinedAt: !992)
!992 = distinct !DILocation(line: 649, column: 14, scope: !930)
!993 = !DILocation(line: 377, column: 43, scope: !821, inlinedAt: !992)
!994 = !DILocation(line: 378, column: 62, scope: !821, inlinedAt: !992)
!995 = !DILocation(line: 379, column: 42, scope: !821, inlinedAt: !992)
!996 = !DILocation(line: 380, column: 66, scope: !821, inlinedAt: !992)
!997 = !DILocation(line: 386, column: 27, scope: !841, inlinedAt: !992)
!998 = !DILocation(line: 382, column: 24, scope: !821, inlinedAt: !992)
!999 = !DILocation(line: 386, column: 12, scope: !841, inlinedAt: !992)
!1000 = !DILocation(line: 386, column: 7, scope: !821, inlinedAt: !992)
!1001 = !DILocation(line: 389, column: 13, scope: !821, inlinedAt: !992)
!1002 = !DILocation(line: 389, column: 16, scope: !821, inlinedAt: !992)
!1003 = !DILocation(line: 390, column: 30, scope: !821, inlinedAt: !992)
!1004 = !DILocation(line: 390, column: 13, scope: !821, inlinedAt: !992)
!1005 = !DILocation(line: 390, column: 18, scope: !821, inlinedAt: !992)
!1006 = !DILocation(line: 391, column: 13, scope: !821, inlinedAt: !992)
!1007 = !DILocation(line: 391, column: 30, scope: !821, inlinedAt: !992)
!1008 = !DILocation(line: 393, column: 9, scope: !856, inlinedAt: !992)
!1009 = !DILocation(line: 393, column: 7, scope: !821, inlinedAt: !992)
!1010 = !DILocation(line: 395, column: 5, scope: !859, inlinedAt: !992)
!1011 = !DILocation(line: 396, column: 5, scope: !859, inlinedAt: !992)
!1012 = !DILocation(line: 399, column: 13, scope: !821, inlinedAt: !992)
!1013 = !DILocation(line: 399, column: 17, scope: !821, inlinedAt: !992)
!1014 = !DILocation(line: 400, column: 13, scope: !821, inlinedAt: !992)
!1015 = !DILocation(line: 400, column: 18, scope: !821, inlinedAt: !992)
!1016 = !DILocation(line: 401, column: 13, scope: !821, inlinedAt: !992)
!1017 = !DILocation(line: 402, column: 13, scope: !821, inlinedAt: !992)
!1018 = !DILocation(line: 402, column: 29, scope: !821, inlinedAt: !992)
!1019 = !DILocation(line: 403, column: 13, scope: !821, inlinedAt: !992)
!1020 = !DILocation(line: 403, column: 24, scope: !821, inlinedAt: !992)
!1021 = !DILocation(line: 635, column: 24, scope: !930)
!1022 = !DILocation(line: 656, column: 16, scope: !930)
!1023 = !DILocation(line: 657, column: 13, scope: !930)
!1024 = !DILocation(line: 657, column: 21, scope: !930)
!1025 = !DILocation(line: 658, column: 13, scope: !930)
!1026 = !DILocation(line: 658, column: 20, scope: !930)
!1027 = !DILocation(line: 659, column: 21, scope: !930)
!1028 = !DILocation(line: 660, column: 3, scope: !930)
!1029 = !DILocation(line: 0, scope: !930)
!1030 = !DILocation(line: 661, column: 1, scope: !930)
!1031 = distinct !DISubprogram(name: "file_reader", scope: !1, file: !1, line: 453, type: !190, isLocal: true, isDefinition: true, scopeLine: 457, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !1032)
!1032 = !{!1033, !1034, !1035, !1036, !1037, !1038, !1039}
!1033 = !DILocalVariable(name: "cls", arg: 1, scope: !1031, file: !1, line: 453, type: !144)
!1034 = !DILocalVariable(name: "pos", arg: 2, scope: !1031, file: !1, line: 454, type: !195)
!1035 = !DILocalVariable(name: "buf", arg: 3, scope: !1031, file: !1, line: 455, type: !179)
!1036 = !DILocalVariable(name: "max", arg: 4, scope: !1031, file: !1, line: 456, type: !150)
!1037 = !DILocalVariable(name: "response", scope: !1031, file: !1, line: 458, type: !170)
!1038 = !DILocalVariable(name: "n", scope: !1031, file: !1, line: 460, type: !192)
!1039 = !DILocalVariable(name: "offset64", scope: !1031, file: !1, line: 464, type: !1040)
!1040 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!1041 = !DILocation(line: 453, column: 20, scope: !1031)
!1042 = !DILocation(line: 454, column: 23, scope: !1031)
!1043 = !DILocation(line: 455, column: 20, scope: !1031)
!1044 = !DILocation(line: 456, column: 21, scope: !1031)
!1045 = !DILocation(line: 458, column: 24, scope: !1031)
!1046 = !DILocation(line: 464, column: 55, scope: !1031)
!1047 = !DILocation(line: 464, column: 43, scope: !1031)
!1048 = !DILocation(line: 464, column: 17, scope: !1031)
!1049 = !DILocation(line: 466, column: 16, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1031, file: !1, line: 466, column: 7)
!1051 = !DILocation(line: 466, column: 7, scope: !1031)
!1052 = !DILocation(line: 470, column: 7, scope: !1031)
!1053 = !DILocation(line: 474, column: 26, scope: !1031)
!1054 = !DILocation(line: 474, column: 7, scope: !1031)
!1055 = !DILocation(line: 460, column: 11, scope: !1031)
!1056 = !DILocation(line: 502, column: 9, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !1031, file: !1, line: 502, column: 7)
!1058 = !DILocation(line: 502, column: 7, scope: !1031)
!1059 = !DILocation(line: 504, column: 9, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1031, file: !1, line: 504, column: 7)
!1061 = !DILocation(line: 505, column: 5, scope: !1060)
!1062 = !DILocation(line: 0, scope: !1031)
!1063 = !DILocation(line: 527, column: 1, scope: !1031)
!1064 = distinct !DISubprogram(name: "free_callback", scope: !1, file: !1, line: 576, type: !200, isLocal: true, isDefinition: true, scopeLine: 577, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !1065)
!1065 = !{!1066, !1067}
!1066 = !DILocalVariable(name: "cls", arg: 1, scope: !1064, file: !1, line: 576, type: !144)
!1067 = !DILocalVariable(name: "response", scope: !1064, file: !1, line: 578, type: !170)
!1068 = !DILocation(line: 576, column: 22, scope: !1064)
!1069 = !DILocation(line: 578, column: 24, scope: !1064)
!1070 = !DILocation(line: 580, column: 27, scope: !1064)
!1071 = !DILocation(line: 580, column: 10, scope: !1064)
!1072 = !DILocation(line: 581, column: 16, scope: !1064)
!1073 = !DILocation(line: 582, column: 1, scope: !1064)
!1074 = distinct !DISubprogram(name: "MHD_create_response_from_pipe", scope: !1, file: !1, line: 675, type: !1075, isLocal: false, isDefinition: true, scopeLine: 676, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !1077)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!170, !55}
!1077 = !{!1078, !1079}
!1078 = !DILocalVariable(name: "fd", arg: 1, scope: !1074, file: !1, line: 675, type: !55)
!1079 = !DILocalVariable(name: "response", scope: !1074, file: !1, line: 677, type: !170)
!1080 = !DILocation(line: 675, column: 36, scope: !1074)
!1081 = !DILocation(line: 376, column: 45, scope: !821, inlinedAt: !1082)
!1082 = distinct !DILocation(line: 679, column: 14, scope: !1074)
!1083 = !DILocation(line: 377, column: 43, scope: !821, inlinedAt: !1082)
!1084 = !DILocation(line: 378, column: 62, scope: !821, inlinedAt: !1082)
!1085 = !DILocation(line: 379, column: 42, scope: !821, inlinedAt: !1082)
!1086 = !DILocation(line: 380, column: 66, scope: !821, inlinedAt: !1082)
!1087 = !DILocation(line: 386, column: 27, scope: !841, inlinedAt: !1082)
!1088 = !DILocation(line: 382, column: 24, scope: !821, inlinedAt: !1082)
!1089 = !DILocation(line: 386, column: 12, scope: !841, inlinedAt: !1082)
!1090 = !DILocation(line: 386, column: 7, scope: !821, inlinedAt: !1082)
!1091 = !DILocation(line: 389, column: 13, scope: !821, inlinedAt: !1082)
!1092 = !DILocation(line: 389, column: 16, scope: !821, inlinedAt: !1082)
!1093 = !DILocation(line: 390, column: 30, scope: !821, inlinedAt: !1082)
!1094 = !DILocation(line: 390, column: 13, scope: !821, inlinedAt: !1082)
!1095 = !DILocation(line: 390, column: 18, scope: !821, inlinedAt: !1082)
!1096 = !DILocation(line: 391, column: 13, scope: !821, inlinedAt: !1082)
!1097 = !DILocation(line: 391, column: 30, scope: !821, inlinedAt: !1082)
!1098 = !DILocation(line: 393, column: 9, scope: !856, inlinedAt: !1082)
!1099 = !DILocation(line: 393, column: 7, scope: !821, inlinedAt: !1082)
!1100 = !DILocation(line: 395, column: 5, scope: !859, inlinedAt: !1082)
!1101 = !DILocation(line: 396, column: 5, scope: !859, inlinedAt: !1082)
!1102 = !DILocation(line: 399, column: 13, scope: !821, inlinedAt: !1082)
!1103 = !DILocation(line: 399, column: 17, scope: !821, inlinedAt: !1082)
!1104 = !DILocation(line: 400, column: 13, scope: !821, inlinedAt: !1082)
!1105 = !DILocation(line: 400, column: 18, scope: !821, inlinedAt: !1082)
!1106 = !DILocation(line: 401, column: 13, scope: !821, inlinedAt: !1082)
!1107 = !DILocation(line: 402, column: 13, scope: !821, inlinedAt: !1082)
!1108 = !DILocation(line: 402, column: 29, scope: !821, inlinedAt: !1082)
!1109 = !DILocation(line: 403, column: 13, scope: !821, inlinedAt: !1082)
!1110 = !DILocation(line: 403, column: 24, scope: !821, inlinedAt: !1082)
!1111 = !DILocation(line: 677, column: 24, scope: !1074)
!1112 = !DILocation(line: 686, column: 16, scope: !1074)
!1113 = !DILocation(line: 687, column: 13, scope: !1074)
!1114 = !DILocation(line: 687, column: 21, scope: !1074)
!1115 = !DILocation(line: 688, column: 21, scope: !1074)
!1116 = !DILocation(line: 689, column: 3, scope: !1074)
!1117 = !DILocation(line: 0, scope: !1074)
!1118 = !DILocation(line: 690, column: 1, scope: !1074)
!1119 = distinct !DISubprogram(name: "pipe_reader", scope: !1, file: !1, line: 541, type: !190, isLocal: true, isDefinition: true, scopeLine: 545, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !1120)
!1120 = !{!1121, !1122, !1123, !1124, !1125, !1126}
!1121 = !DILocalVariable(name: "cls", arg: 1, scope: !1119, file: !1, line: 541, type: !144)
!1122 = !DILocalVariable(name: "pos", arg: 2, scope: !1119, file: !1, line: 542, type: !195)
!1123 = !DILocalVariable(name: "buf", arg: 3, scope: !1119, file: !1, line: 543, type: !179)
!1124 = !DILocalVariable(name: "max", arg: 4, scope: !1119, file: !1, line: 544, type: !150)
!1125 = !DILocalVariable(name: "response", scope: !1119, file: !1, line: 546, type: !170)
!1126 = !DILocalVariable(name: "n", scope: !1119, file: !1, line: 547, type: !192)
!1127 = !DILocation(line: 541, column: 20, scope: !1119)
!1128 = !DILocation(line: 542, column: 23, scope: !1119)
!1129 = !DILocation(line: 543, column: 20, scope: !1119)
!1130 = !DILocation(line: 544, column: 21, scope: !1119)
!1131 = !DILocation(line: 546, column: 24, scope: !1119)
!1132 = !DILocation(line: 551, column: 7, scope: !1119)
!1133 = !DILocation(line: 558, column: 23, scope: !1119)
!1134 = !DILocation(line: 558, column: 7, scope: !1119)
!1135 = !DILocation(line: 547, column: 11, scope: !1119)
!1136 = !DILocation(line: 561, column: 9, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1119, file: !1, line: 561, column: 7)
!1138 = !DILocation(line: 563, column: 9, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1119, file: !1, line: 563, column: 7)
!1140 = !DILocation(line: 564, column: 5, scope: !1139)
!1141 = !DILocation(line: 561, column: 7, scope: !1119)
!1142 = !DILocation(line: 566, column: 1, scope: !1119)
!1143 = distinct !DISubprogram(name: "MHD_create_response_from_fd", scope: !1, file: !1, line: 703, type: !1144, isLocal: false, isDefinition: true, scopeLine: 705, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !1146)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!170, !150, !55}
!1146 = !{!1147, !1148}
!1147 = !DILocalVariable(name: "size", arg: 1, scope: !1143, file: !1, line: 703, type: !150)
!1148 = !DILocalVariable(name: "fd", arg: 2, scope: !1143, file: !1, line: 704, type: !55)
!1149 = !DILocation(line: 703, column: 37, scope: !1143)
!1150 = !DILocation(line: 704, column: 34, scope: !1143)
!1151 = !DILocation(line: 631, column: 51, scope: !930, inlinedAt: !1152)
!1152 = distinct !DILocation(line: 706, column: 10, scope: !1143)
!1153 = !DILocation(line: 632, column: 46, scope: !930, inlinedAt: !1152)
!1154 = !DILocation(line: 633, column: 51, scope: !930, inlinedAt: !1152)
!1155 = !DILocation(line: 644, column: 29, scope: !942, inlinedAt: !1152)
!1156 = !DILocation(line: 376, column: 45, scope: !821, inlinedAt: !1157)
!1157 = distinct !DILocation(line: 649, column: 14, scope: !930, inlinedAt: !1152)
!1158 = !DILocation(line: 377, column: 43, scope: !821, inlinedAt: !1157)
!1159 = !DILocation(line: 378, column: 62, scope: !821, inlinedAt: !1157)
!1160 = !DILocation(line: 379, column: 42, scope: !821, inlinedAt: !1157)
!1161 = !DILocation(line: 380, column: 66, scope: !821, inlinedAt: !1157)
!1162 = !DILocation(line: 386, column: 27, scope: !841, inlinedAt: !1157)
!1163 = !DILocation(line: 382, column: 24, scope: !821, inlinedAt: !1157)
!1164 = !DILocation(line: 386, column: 12, scope: !841, inlinedAt: !1157)
!1165 = !DILocation(line: 386, column: 7, scope: !821, inlinedAt: !1157)
!1166 = !DILocation(line: 389, column: 13, scope: !821, inlinedAt: !1157)
!1167 = !DILocation(line: 389, column: 16, scope: !821, inlinedAt: !1157)
!1168 = !DILocation(line: 390, column: 30, scope: !821, inlinedAt: !1157)
!1169 = !DILocation(line: 390, column: 13, scope: !821, inlinedAt: !1157)
!1170 = !DILocation(line: 390, column: 18, scope: !821, inlinedAt: !1157)
!1171 = !DILocation(line: 391, column: 13, scope: !821, inlinedAt: !1157)
!1172 = !DILocation(line: 391, column: 30, scope: !821, inlinedAt: !1157)
!1173 = !DILocation(line: 393, column: 9, scope: !856, inlinedAt: !1157)
!1174 = !DILocation(line: 393, column: 7, scope: !821, inlinedAt: !1157)
!1175 = !DILocation(line: 395, column: 5, scope: !859, inlinedAt: !1157)
!1176 = !DILocation(line: 396, column: 5, scope: !859, inlinedAt: !1157)
!1177 = !DILocation(line: 399, column: 13, scope: !821, inlinedAt: !1157)
!1178 = !DILocation(line: 399, column: 17, scope: !821, inlinedAt: !1157)
!1179 = !DILocation(line: 400, column: 13, scope: !821, inlinedAt: !1157)
!1180 = !DILocation(line: 400, column: 18, scope: !821, inlinedAt: !1157)
!1181 = !DILocation(line: 401, column: 13, scope: !821, inlinedAt: !1157)
!1182 = !DILocation(line: 402, column: 13, scope: !821, inlinedAt: !1157)
!1183 = !DILocation(line: 402, column: 29, scope: !821, inlinedAt: !1157)
!1184 = !DILocation(line: 403, column: 13, scope: !821, inlinedAt: !1157)
!1185 = !DILocation(line: 403, column: 24, scope: !821, inlinedAt: !1157)
!1186 = !DILocation(line: 635, column: 24, scope: !930, inlinedAt: !1152)
!1187 = !DILocation(line: 656, column: 16, scope: !930, inlinedAt: !1152)
!1188 = !DILocation(line: 657, column: 13, scope: !930, inlinedAt: !1152)
!1189 = !DILocation(line: 657, column: 21, scope: !930, inlinedAt: !1152)
!1190 = !DILocation(line: 658, column: 13, scope: !930, inlinedAt: !1152)
!1191 = !DILocation(line: 658, column: 20, scope: !930, inlinedAt: !1152)
!1192 = !DILocation(line: 659, column: 21, scope: !930, inlinedAt: !1152)
!1193 = !DILocation(line: 660, column: 3, scope: !930, inlinedAt: !1152)
!1194 = !DILocation(line: 0, scope: !930, inlinedAt: !1152)
!1195 = !DILocation(line: 706, column: 3, scope: !1143)
!1196 = distinct !DISubprogram(name: "MHD_create_response_from_fd64", scope: !1, file: !1, line: 726, type: !1197, isLocal: false, isDefinition: true, scopeLine: 728, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !1199)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{!170, !195, !55}
!1199 = !{!1200, !1201}
!1200 = !DILocalVariable(name: "size", arg: 1, scope: !1196, file: !1, line: 726, type: !195)
!1201 = !DILocalVariable(name: "fd", arg: 2, scope: !1196, file: !1, line: 727, type: !55)
!1202 = !DILocation(line: 726, column: 41, scope: !1196)
!1203 = !DILocation(line: 727, column: 36, scope: !1196)
!1204 = !DILocation(line: 631, column: 51, scope: !930, inlinedAt: !1205)
!1205 = distinct !DILocation(line: 729, column: 10, scope: !1196)
!1206 = !DILocation(line: 632, column: 46, scope: !930, inlinedAt: !1205)
!1207 = !DILocation(line: 633, column: 51, scope: !930, inlinedAt: !1205)
!1208 = !DILocation(line: 644, column: 29, scope: !942, inlinedAt: !1205)
!1209 = !DILocation(line: 376, column: 45, scope: !821, inlinedAt: !1210)
!1210 = distinct !DILocation(line: 649, column: 14, scope: !930, inlinedAt: !1205)
!1211 = !DILocation(line: 377, column: 43, scope: !821, inlinedAt: !1210)
!1212 = !DILocation(line: 378, column: 62, scope: !821, inlinedAt: !1210)
!1213 = !DILocation(line: 379, column: 42, scope: !821, inlinedAt: !1210)
!1214 = !DILocation(line: 380, column: 66, scope: !821, inlinedAt: !1210)
!1215 = !DILocation(line: 386, column: 27, scope: !841, inlinedAt: !1210)
!1216 = !DILocation(line: 382, column: 24, scope: !821, inlinedAt: !1210)
!1217 = !DILocation(line: 386, column: 12, scope: !841, inlinedAt: !1210)
!1218 = !DILocation(line: 386, column: 7, scope: !821, inlinedAt: !1210)
!1219 = !DILocation(line: 389, column: 13, scope: !821, inlinedAt: !1210)
!1220 = !DILocation(line: 389, column: 16, scope: !821, inlinedAt: !1210)
!1221 = !DILocation(line: 390, column: 30, scope: !821, inlinedAt: !1210)
!1222 = !DILocation(line: 390, column: 13, scope: !821, inlinedAt: !1210)
!1223 = !DILocation(line: 390, column: 18, scope: !821, inlinedAt: !1210)
!1224 = !DILocation(line: 391, column: 13, scope: !821, inlinedAt: !1210)
!1225 = !DILocation(line: 391, column: 30, scope: !821, inlinedAt: !1210)
!1226 = !DILocation(line: 393, column: 9, scope: !856, inlinedAt: !1210)
!1227 = !DILocation(line: 393, column: 7, scope: !821, inlinedAt: !1210)
!1228 = !DILocation(line: 395, column: 5, scope: !859, inlinedAt: !1210)
!1229 = !DILocation(line: 396, column: 5, scope: !859, inlinedAt: !1210)
!1230 = !DILocation(line: 399, column: 13, scope: !821, inlinedAt: !1210)
!1231 = !DILocation(line: 399, column: 17, scope: !821, inlinedAt: !1210)
!1232 = !DILocation(line: 400, column: 13, scope: !821, inlinedAt: !1210)
!1233 = !DILocation(line: 400, column: 18, scope: !821, inlinedAt: !1210)
!1234 = !DILocation(line: 401, column: 13, scope: !821, inlinedAt: !1210)
!1235 = !DILocation(line: 402, column: 13, scope: !821, inlinedAt: !1210)
!1236 = !DILocation(line: 402, column: 29, scope: !821, inlinedAt: !1210)
!1237 = !DILocation(line: 403, column: 13, scope: !821, inlinedAt: !1210)
!1238 = !DILocation(line: 403, column: 24, scope: !821, inlinedAt: !1210)
!1239 = !DILocation(line: 635, column: 24, scope: !930, inlinedAt: !1205)
!1240 = !DILocation(line: 656, column: 16, scope: !930, inlinedAt: !1205)
!1241 = !DILocation(line: 657, column: 13, scope: !930, inlinedAt: !1205)
!1242 = !DILocation(line: 657, column: 21, scope: !930, inlinedAt: !1205)
!1243 = !DILocation(line: 658, column: 13, scope: !930, inlinedAt: !1205)
!1244 = !DILocation(line: 658, column: 20, scope: !930, inlinedAt: !1205)
!1245 = !DILocation(line: 659, column: 21, scope: !930, inlinedAt: !1205)
!1246 = !DILocation(line: 660, column: 3, scope: !930, inlinedAt: !1205)
!1247 = !DILocation(line: 0, scope: !930, inlinedAt: !1205)
!1248 = !DILocation(line: 729, column: 3, scope: !1196)
!1249 = distinct !DISubprogram(name: "MHD_create_response_from_data", scope: !1, file: !1, line: 750, type: !1250, isLocal: false, isDefinition: true, scopeLine: 754, flags: DIFlagPrototyped, isOptimized: true, unit: !0, retainedNodes: !1252)
!1250 = !DISubroutineType(types: !1251)
!1251 = !{!170, !150, !144, !55, !55}
!1252 = !{!1253, !1254, !1255, !1256, !1257, !1258}
!1253 = !DILocalVariable(name: "size", arg: 1, scope: !1249, file: !1, line: 750, type: !150)
!1254 = !DILocalVariable(name: "data", arg: 2, scope: !1249, file: !1, line: 751, type: !144)
!1255 = !DILocalVariable(name: "must_free", arg: 3, scope: !1249, file: !1, line: 752, type: !55)
!1256 = !DILocalVariable(name: "must_copy", arg: 4, scope: !1249, file: !1, line: 753, type: !55)
!1257 = !DILocalVariable(name: "response", scope: !1249, file: !1, line: 755, type: !170)
!1258 = !DILocalVariable(name: "tmp", scope: !1249, file: !1, line: 756, type: !144)
!1259 = !DILocation(line: 750, column: 39, scope: !1249)
!1260 = !DILocation(line: 751, column: 38, scope: !1249)
!1261 = !DILocation(line: 752, column: 36, scope: !1249)
!1262 = !DILocation(line: 753, column: 36, scope: !1249)
!1263 = !DILocation(line: 758, column: 13, scope: !1264)
!1264 = distinct !DILexicalBlock(scope: !1249, file: !1, line: 758, column: 7)
!1265 = !DILocation(line: 758, column: 31, scope: !1264)
!1266 = !DILocation(line: 758, column: 22, scope: !1264)
!1267 = !DILocation(line: 760, column: 27, scope: !1268)
!1268 = distinct !DILexicalBlock(scope: !1249, file: !1, line: 760, column: 7)
!1269 = !DILocation(line: 755, column: 24, scope: !1249)
!1270 = !DILocation(line: 760, column: 12, scope: !1268)
!1271 = !DILocation(line: 760, column: 7, scope: !1249)
!1272 = !DILocation(line: 762, column: 13, scope: !1249)
!1273 = !DILocation(line: 762, column: 16, scope: !1249)
!1274 = !DILocation(line: 764, column: 9, scope: !1275)
!1275 = distinct !DILexicalBlock(scope: !1249, file: !1, line: 764, column: 7)
!1276 = !DILocation(line: 764, column: 7, scope: !1249)
!1277 = !DILocation(line: 766, column: 5, scope: !1278)
!1278 = distinct !DILexicalBlock(scope: !1275, file: !1, line: 765, column: 3)
!1279 = !DILocation(line: 767, column: 5, scope: !1278)
!1280 = !DILocation(line: 770, column: 7, scope: !1281)
!1281 = distinct !DILexicalBlock(scope: !1249, file: !1, line: 770, column: 7)
!1282 = !DILocation(line: 770, column: 19, scope: !1281)
!1283 = !DILocation(line: 772, column: 24, scope: !1284)
!1284 = distinct !DILexicalBlock(scope: !1285, file: !1, line: 772, column: 9)
!1285 = distinct !DILexicalBlock(scope: !1281, file: !1, line: 771, column: 3)
!1286 = !DILocation(line: 756, column: 9, scope: !1249)
!1287 = !DILocation(line: 772, column: 14, scope: !1284)
!1288 = !DILocation(line: 772, column: 9, scope: !1285)
!1289 = !DILocation(line: 775, column: 7, scope: !1290)
!1290 = distinct !DILexicalBlock(scope: !1291, file: !1, line: 775, column: 7)
!1291 = distinct !DILexicalBlock(scope: !1292, file: !1, line: 775, column: 7)
!1292 = distinct !DILexicalBlock(scope: !1284, file: !1, line: 773, column: 5)
!1293 = !DILocation(line: 775, column: 7, scope: !1291)
!1294 = !DILocation(line: 775, column: 7, scope: !1295)
!1295 = distinct !DILexicalBlock(scope: !1290, file: !1, line: 775, column: 7)
!1296 = !DILocation(line: 777, column: 7, scope: !1292)
!1297 = !DILocation(line: 778, column: 7, scope: !1292)
!1298 = !DILocation(line: 780, column: 5, scope: !1285)
!1299 = !DILocation(line: 784, column: 7, scope: !1249)
!1300 = !DILocation(line: 784, column: 7, scope: !1301)
!1301 = distinct !DILexicalBlock(scope: !1249, file: !1, line: 784, column: 7)
!1302 = !DILocation(line: 786, column: 15, scope: !1303)
!1303 = distinct !DILexicalBlock(scope: !1301, file: !1, line: 785, column: 3)
!1304 = !DILocation(line: 786, column: 20, scope: !1303)
!1305 = !DILocation(line: 787, column: 15, scope: !1303)
!1306 = !DILocation(line: 787, column: 23, scope: !1303)
!1307 = !DILocation(line: 788, column: 3, scope: !1303)
!1308 = !DILocation(line: 789, column: 13, scope: !1249)
!1309 = !DILocation(line: 789, column: 29, scope: !1249)
!1310 = !DILocation(line: 790, column: 13, scope: !1249)
!1311 = !DILocation(line: 790, column: 24, scope: !1249)
!1312 = !DILocation(line: 791, column: 13, scope: !1249)
!1313 = !DILocation(line: 791, column: 18, scope: !1249)
!1314 = !DILocation(line: 792, column: 13, scope: !1249)
!1315 = !DILocation(line: 792, column: 23, scope: !1249)
!1316 = !{!515, !519, i64 120}
!1317 = !DILocation(line: 793, column: 7, scope: !1249)
!1318 = !DILocation(line: 794, column: 15, scope: !1319)
!1319 = distinct !DILexicalBlock(scope: !1249, file: !1, line: 793, column: 7)
!1320 = !DILocation(line: 794, column: 32, scope: !1319)
!1321 = !DILocation(line: 794, column: 5, scope: !1319)
!1322 = !DILocation(line: 0, scope: !1249)
!1323 = !DILocation(line: 796, column: 1, scope: !1249)
